MikroElektronika/core_packages/PIC/XC8/def/PIC16LF1786/mcu.h
extern volatile SLRCONBbits_t SLRCONBbits __at(0x30D);
// bitfield macros
#define _SLRCONB_SLRCONB0_POSN                              0x0
#define _SLRCONB_SLRCONB0_POSITION                          0x0
#define _SLRCONB_SLRCONB0_SIZE                              0x1
#define _SLRCONB_SLRCONB0_LENGTH                            0x1
#define _SLRCONB_SLRCONB0_MASK                              0x1
#define _SLRCONB_SLRCONB1_POSN                              0x1
#define _SLRCONB_SLRCONB1_POSITION                          0x1
#define _SLRCONB_SLRCONB1_SIZE                              0x1
#define _SLRCONB_SLRCONB1_LENGTH                            0x1
#define _SLRCONB_SLRCONB1_MASK                              0x2
#define _SLRCONB_SLRCONB2_POSN                              0x2
#define _SLRCONB_SLRCONB2_POSITION                          0x2
#define _SLRCONB_SLRCONB2_SIZE                              0x1
#define _SLRCONB_SLRCONB2_LENGTH                            0x1
#define _SLRCONB_SLRCONB2_MASK                              0x4
#define _SLRCONB_SLRCONB3_POSN                              0x3
#define _SLRCONB_SLRCONB3_POSITION                          0x3
#define _SLRCONB_SLRCONB3_SIZE                              0x1
#define _SLRCONB_SLRCONB3_LENGTH                            0x1
#define _SLRCONB_SLRCONB3_MASK                              0x8
#define _SLRCONB_SLRCONB4_POSN                              0x4
#define _SLRCONB_SLRCONB4_POSITION                          0x4
#define _SLRCONB_SLRCONB4_SIZE                              0x1
#define _SLRCONB_SLRCONB4_LENGTH                            0x1
#define _SLRCONB_SLRCONB4_MASK                              0x10
#define _SLRCONB_SLRCONB5_POSN                              0x5
#define _SLRCONB_SLRCONB5_POSITION                          0x5
#define _SLRCONB_SLRCONB5_SIZE                              0x1
#define _SLRCONB_SLRCONB5_LENGTH                            0x1
#define _SLRCONB_SLRCONB5_MASK                              0x20
#define _SLRCONB_SLRCONB6_POSN                              0x6
#define _SLRCONB_SLRCONB6_POSITION                          0x6
#define _SLRCONB_SLRCONB6_SIZE                              0x1
#define _SLRCONB_SLRCONB6_LENGTH                            0x1
#define _SLRCONB_SLRCONB6_MASK                              0x40
#define _SLRCONB_SLRCONB7_POSN                              0x7
#define _SLRCONB_SLRCONB7_POSITION                          0x7
#define _SLRCONB_SLRCONB7_SIZE                              0x1
#define _SLRCONB_SLRCONB7_LENGTH                            0x1
#define _SLRCONB_SLRCONB7_MASK                              0x80
#define _SLRCONB_SLRCONB_POSN                               0x0
#define _SLRCONB_SLRCONB_POSITION                           0x0
#define _SLRCONB_SLRCONB_SIZE                               0x8
#define _SLRCONB_SLRCONB_LENGTH                             0x8
#define _SLRCONB_SLRCONB_MASK                               0xFF

// Register: SLRCONC
#define SLRCONC SLRCONC
extern volatile unsigned char           SLRCONC             __at(0x30E);
#ifndef _LIB_BUILD
asm("SLRCONC equ 030Eh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned SLRCONC0               :1;
        unsigned SLRCONC1               :1;
        unsigned SLRCONC2               :1;
        unsigned SLRCONC3               :1;
        unsigned SLRCONC4               :1;
        unsigned SLRCONC5               :1;
        unsigned SLRCONC6               :1;
        unsigned SLRCONC7               :1;
    };
    struct {
        unsigned SLRCONC                :8;
    };
} SLRCONCbits_t;
extern volatile SLRCONCbits_t SLRCONCbits __at(0x30E);
// bitfield macros
#define _SLRCONC_SLRCONC0_POSN                              0x0
#define _SLRCONC_SLRCONC0_POSITION                          0x0
#define _SLRCONC_SLRCONC0_SIZE                              0x1
#define _SLRCONC_SLRCONC0_LENGTH                            0x1
#define _SLRCONC_SLRCONC0_MASK                              0x1
#define _SLRCONC_SLRCONC1_POSN                              0x1
#define _SLRCONC_SLRCONC1_POSITION                          0x1
#define _SLRCONC_SLRCONC1_SIZE                              0x1
#define _SLRCONC_SLRCONC1_LENGTH                            0x1
#define _SLRCONC_SLRCONC1_MASK                              0x2
#define _SLRCONC_SLRCONC2_POSN                              0x2
#define _SLRCONC_SLRCONC2_POSITION                          0x2
#define _SLRCONC_SLRCONC2_SIZE                              0x1
#define _SLRCONC_SLRCONC2_LENGTH                            0x1
#define _SLRCONC_SLRCONC2_MASK                              0x4
#define _SLRCONC_SLRCONC3_POSN                              0x3
#define _SLRCONC_SLRCONC3_POSITION                          0x3
#define _SLRCONC_SLRCONC3_SIZE                              0x1
#define _SLRCONC_SLRCONC3_LENGTH                            0x1
#define _SLRCONC_SLRCONC3_MASK                              0x8
#define _SLRCONC_SLRCONC4_POSN                              0x4
#define _SLRCONC_SLRCONC4_POSITION                          0x4
#define _SLRCONC_SLRCONC4_SIZE                              0x1
#define _SLRCONC_SLRCONC4_LENGTH                            0x1
#define _SLRCONC_SLRCONC4_MASK                              0x10
#define _SLRCONC_SLRCONC5_POSN                              0x5
#define _SLRCONC_SLRCONC5_POSITION                          0x5
#define _SLRCONC_SLRCONC5_SIZE                              0x1
#define _SLRCONC_SLRCONC5_LENGTH                            0x1
#define _SLRCONC_SLRCONC5_MASK                              0x20
#define _SLRCONC_SLRCONC6_POSN                              0x6
#define _SLRCONC_SLRCONC6_POSITION                          0x6
#define _SLRCONC_SLRCONC6_SIZE                              0x1
#define _SLRCONC_SLRCONC6_LENGTH                            0x1
#define _SLRCONC_SLRCONC6_MASK                              0x40
#define _SLRCONC_SLRCONC7_POSN                              0x7
#define _SLRCONC_SLRCONC7_POSITION                          0x7
#define _SLRCONC_SLRCONC7_SIZE                              0x1
#define _SLRCONC_SLRCONC7_LENGTH                            0x1
#define _SLRCONC_SLRCONC7_MASK                              0x80
#define _SLRCONC_SLRCONC_POSN                               0x0
#define _SLRCONC_SLRCONC_POSITION                           0x0
#define _SLRCONC_SLRCONC_SIZE                               0x8
#define _SLRCONC_SLRCONC_LENGTH                             0x8
#define _SLRCONC_SLRCONC_MASK                               0xFF

// Register: CCPR3
#define CCPR3 CCPR3
extern volatile unsigned short          CCPR3               __at(0x311);
#ifndef _LIB_BUILD
asm("CCPR3 equ 0311h");
#endif

