MikroElektronika/core_packages/PIC/XC8/def/PIC16LF1786/mcu.h
extern volatile PSMC2OENbits_t PSMC2OENbits __at(0x835);
// bitfield macros
#define _PSMC2OEN_P2OEA_POSN                                0x0
#define _PSMC2OEN_P2OEA_POSITION                            0x0
#define _PSMC2OEN_P2OEA_SIZE                                0x1
#define _PSMC2OEN_P2OEA_LENGTH                              0x1
#define _PSMC2OEN_P2OEA_MASK                                0x1
#define _PSMC2OEN_P2OEB_POSN                                0x1
#define _PSMC2OEN_P2OEB_POSITION                            0x1
#define _PSMC2OEN_P2OEB_SIZE                                0x1
#define _PSMC2OEN_P2OEB_LENGTH                              0x1
#define _PSMC2OEN_P2OEB_MASK                                0x2

// Register: PSMC2POL
#define PSMC2POL PSMC2POL
extern volatile unsigned char           PSMC2POL            __at(0x836);
#ifndef _LIB_BUILD
asm("PSMC2POL equ 0836h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned P2POLA                 :1;
        unsigned P2POLB                 :1;
        unsigned                        :4;
        unsigned P2INPOL                :1;
    };
} PSMC2POLbits_t;
extern volatile PSMC2POLbits_t PSMC2POLbits __at(0x836);
// bitfield macros
#define _PSMC2POL_P2POLA_POSN                               0x0
#define _PSMC2POL_P2POLA_POSITION                           0x0
#define _PSMC2POL_P2POLA_SIZE                               0x1
#define _PSMC2POL_P2POLA_LENGTH                             0x1
#define _PSMC2POL_P2POLA_MASK                               0x1
#define _PSMC2POL_P2POLB_POSN                               0x1
#define _PSMC2POL_P2POLB_POSITION                           0x1
#define _PSMC2POL_P2POLB_SIZE                               0x1
#define _PSMC2POL_P2POLB_LENGTH                             0x1
#define _PSMC2POL_P2POLB_MASK                               0x2
#define _PSMC2POL_P2INPOL_POSN                              0x6
#define _PSMC2POL_P2INPOL_POSITION                          0x6
#define _PSMC2POL_P2INPOL_SIZE                              0x1
#define _PSMC2POL_P2INPOL_LENGTH                            0x1
#define _PSMC2POL_P2INPOL_MASK                              0x40

// Register: PSMC2BLNK
#define PSMC2BLNK PSMC2BLNK
extern volatile unsigned char           PSMC2BLNK           __at(0x837);
#ifndef _LIB_BUILD
asm("PSMC2BLNK equ 0837h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned P2REBM                 :2;
        unsigned                        :2;
        unsigned P2FEBM                 :2;
    };
    struct {
        unsigned P2REBM0                :1;
        unsigned P2REBM1                :1;
        unsigned                        :2;
        unsigned P2FEBM0                :1;
        unsigned P2FEBM1                :1;
    };
} PSMC2BLNKbits_t;
extern volatile PSMC2BLNKbits_t PSMC2BLNKbits __at(0x837);
// bitfield macros
#define _PSMC2BLNK_P2REBM_POSN                              0x0
#define _PSMC2BLNK_P2REBM_POSITION                          0x0
#define _PSMC2BLNK_P2REBM_SIZE                              0x2
#define _PSMC2BLNK_P2REBM_LENGTH                            0x2
#define _PSMC2BLNK_P2REBM_MASK                              0x3
#define _PSMC2BLNK_P2FEBM_POSN                              0x4
#define _PSMC2BLNK_P2FEBM_POSITION                          0x4
#define _PSMC2BLNK_P2FEBM_SIZE                              0x2
#define _PSMC2BLNK_P2FEBM_LENGTH                            0x2
#define _PSMC2BLNK_P2FEBM_MASK                              0x30
#define _PSMC2BLNK_P2REBM0_POSN                             0x0
#define _PSMC2BLNK_P2REBM0_POSITION                         0x0
#define _PSMC2BLNK_P2REBM0_SIZE                             0x1
#define _PSMC2BLNK_P2REBM0_LENGTH                           0x1
#define _PSMC2BLNK_P2REBM0_MASK                             0x1
#define _PSMC2BLNK_P2REBM1_POSN                             0x1
#define _PSMC2BLNK_P2REBM1_POSITION                         0x1
#define _PSMC2BLNK_P2REBM1_SIZE                             0x1
#define _PSMC2BLNK_P2REBM1_LENGTH                           0x1
#define _PSMC2BLNK_P2REBM1_MASK                             0x2
#define _PSMC2BLNK_P2FEBM0_POSN                             0x4
#define _PSMC2BLNK_P2FEBM0_POSITION                         0x4
#define _PSMC2BLNK_P2FEBM0_SIZE                             0x1
#define _PSMC2BLNK_P2FEBM0_LENGTH                           0x1
#define _PSMC2BLNK_P2FEBM0_MASK                             0x10
#define _PSMC2BLNK_P2FEBM1_POSN                             0x5
#define _PSMC2BLNK_P2FEBM1_POSITION                         0x5
#define _PSMC2BLNK_P2FEBM1_SIZE                             0x1
#define _PSMC2BLNK_P2FEBM1_LENGTH                           0x1
#define _PSMC2BLNK_P2FEBM1_MASK                             0x20

// Register: PSMC2REBS
#define PSMC2REBS PSMC2REBS
extern volatile unsigned char           PSMC2REBS           __at(0x838);
#ifndef _LIB_BUILD
asm("PSMC2REBS equ 0838h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned                        :1;
        unsigned P2REBSC1               :1;
        unsigned P2REBSC2               :1;
        unsigned P2REBSC3               :1;
        unsigned P2REBSC4               :1;
        unsigned                        :2;
        unsigned P2REBSIN               :1;
    };
} PSMC2REBSbits_t;
extern volatile PSMC2REBSbits_t PSMC2REBSbits __at(0x838);
// bitfield macros
#define _PSMC2REBS_P2REBSC1_POSN                            0x1
#define _PSMC2REBS_P2REBSC1_POSITION                        0x1
#define _PSMC2REBS_P2REBSC1_SIZE                            0x1
#define _PSMC2REBS_P2REBSC1_LENGTH                          0x1
#define _PSMC2REBS_P2REBSC1_MASK                            0x2
#define _PSMC2REBS_P2REBSC2_POSN                            0x2
#define _PSMC2REBS_P2REBSC2_POSITION                        0x2
#define _PSMC2REBS_P2REBSC2_SIZE                            0x1
#define _PSMC2REBS_P2REBSC2_LENGTH                          0x1
#define _PSMC2REBS_P2REBSC2_MASK                            0x4
#define _PSMC2REBS_P2REBSC3_POSN                            0x3
#define _PSMC2REBS_P2REBSC3_POSITION                        0x3
#define _PSMC2REBS_P2REBSC3_SIZE                            0x1
#define _PSMC2REBS_P2REBSC3_LENGTH                          0x1
#define _PSMC2REBS_P2REBSC3_MASK                            0x8
#define _PSMC2REBS_P2REBSC4_POSN                            0x4
#define _PSMC2REBS_P2REBSC4_POSITION                        0x4
#define _PSMC2REBS_P2REBSC4_SIZE                            0x1
#define _PSMC2REBS_P2REBSC4_LENGTH                          0x1
#define _PSMC2REBS_P2REBSC4_MASK                            0x10
#define _PSMC2REBS_P2REBSIN_POSN                            0x7
#define _PSMC2REBS_P2REBSIN_POSITION                        0x7
#define _PSMC2REBS_P2REBSIN_SIZE                            0x1
#define _PSMC2REBS_P2REBSIN_LENGTH                          0x1
#define _PSMC2REBS_P2REBSIN_MASK                            0x80

// Register: PSMC2FEBS
#define PSMC2FEBS PSMC2FEBS
extern volatile unsigned char           PSMC2FEBS           __at(0x839);
#ifndef _LIB_BUILD
asm("PSMC2FEBS equ 0839h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned                        :1;
        unsigned P2FEBSC1               :1;
        unsigned P2FEBSC2               :1;
        unsigned P2FEBSC3               :1;
        unsigned P2FEBSC4               :1;
        unsigned                        :2;
        unsigned P2FEBSIN               :1;
    };
} PSMC2FEBSbits_t;
extern volatile PSMC2FEBSbits_t PSMC2FEBSbits __at(0x839);
// bitfield macros
#define _PSMC2FEBS_P2FEBSC1_POSN                            0x1
#define _PSMC2FEBS_P2FEBSC1_POSITION                        0x1
#define _PSMC2FEBS_P2FEBSC1_SIZE                            0x1
#define _PSMC2FEBS_P2FEBSC1_LENGTH                          0x1
#define _PSMC2FEBS_P2FEBSC1_MASK                            0x2
#define _PSMC2FEBS_P2FEBSC2_POSN                            0x2
#define _PSMC2FEBS_P2FEBSC2_POSITION                        0x2
#define _PSMC2FEBS_P2FEBSC2_SIZE                            0x1
#define _PSMC2FEBS_P2FEBSC2_LENGTH                          0x1
#define _PSMC2FEBS_P2FEBSC2_MASK                            0x4
#define _PSMC2FEBS_P2FEBSC3_POSN                            0x3
#define _PSMC2FEBS_P2FEBSC3_POSITION                        0x3
#define _PSMC2FEBS_P2FEBSC3_SIZE                            0x1
#define _PSMC2FEBS_P2FEBSC3_LENGTH                          0x1
#define _PSMC2FEBS_P2FEBSC3_MASK                            0x8
#define _PSMC2FEBS_P2FEBSC4_POSN                            0x4
#define _PSMC2FEBS_P2FEBSC4_POSITION                        0x4
#define _PSMC2FEBS_P2FEBSC4_SIZE                            0x1
#define _PSMC2FEBS_P2FEBSC4_LENGTH                          0x1
#define _PSMC2FEBS_P2FEBSC4_MASK                            0x10
#define _PSMC2FEBS_P2FEBSIN_POSN                            0x7
#define _PSMC2FEBS_P2FEBSIN_POSITION                        0x7
#define _PSMC2FEBS_P2FEBSIN_SIZE                            0x1
#define _PSMC2FEBS_P2FEBSIN_LENGTH                          0x1
#define _PSMC2FEBS_P2FEBSIN_MASK                            0x80

// Register: PSMC2PHS
#define PSMC2PHS PSMC2PHS
extern volatile unsigned char           PSMC2PHS            __at(0x83A);
#ifndef _LIB_BUILD
asm("PSMC2PHS equ 083Ah");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned P2PHST                 :1;
        unsigned P2PHSC1                :1;
        unsigned P2PHSC2                :1;
        unsigned P2PHSC3                :1;
        unsigned P2PHSC4                :1;
        unsigned                        :2;
        unsigned P2PHSIN                :1;
    };
} PSMC2PHSbits_t;
extern volatile PSMC2PHSbits_t PSMC2PHSbits __at(0x83A);
// bitfield macros
#define _PSMC2PHS_P2PHST_POSN                               0x0
#define _PSMC2PHS_P2PHST_POSITION                           0x0
#define _PSMC2PHS_P2PHST_SIZE                               0x1
#define _PSMC2PHS_P2PHST_LENGTH                             0x1
#define _PSMC2PHS_P2PHST_MASK                               0x1
#define _PSMC2PHS_P2PHSC1_POSN                              0x1
#define _PSMC2PHS_P2PHSC1_POSITION                          0x1
#define _PSMC2PHS_P2PHSC1_SIZE                              0x1
#define _PSMC2PHS_P2PHSC1_LENGTH                            0x1
#define _PSMC2PHS_P2PHSC1_MASK                              0x2
#define _PSMC2PHS_P2PHSC2_POSN                              0x2
#define _PSMC2PHS_P2PHSC2_POSITION                          0x2
#define _PSMC2PHS_P2PHSC2_SIZE                              0x1
#define _PSMC2PHS_P2PHSC2_LENGTH                            0x1
#define _PSMC2PHS_P2PHSC2_MASK                              0x4
#define _PSMC2PHS_P2PHSC3_POSN                              0x3
#define _PSMC2PHS_P2PHSC3_POSITION                          0x3
#define _PSMC2PHS_P2PHSC3_SIZE                              0x1
#define _PSMC2PHS_P2PHSC3_LENGTH                            0x1
#define _PSMC2PHS_P2PHSC3_MASK                              0x8
#define _PSMC2PHS_P2PHSC4_POSN                              0x4
#define _PSMC2PHS_P2PHSC4_POSITION                          0x4
#define _PSMC2PHS_P2PHSC4_SIZE                              0x1
#define _PSMC2PHS_P2PHSC4_LENGTH                            0x1
#define _PSMC2PHS_P2PHSC4_MASK                              0x10
#define _PSMC2PHS_P2PHSIN_POSN                              0x7
#define _PSMC2PHS_P2PHSIN_POSITION                          0x7
#define _PSMC2PHS_P2PHSIN_SIZE                              0x1
#define _PSMC2PHS_P2PHSIN_LENGTH                            0x1
#define _PSMC2PHS_P2PHSIN_MASK                              0x80

// Register: PSMC2DCS
#define PSMC2DCS PSMC2DCS
extern volatile unsigned char           PSMC2DCS            __at(0x83B);
#ifndef _LIB_BUILD
asm("PSMC2DCS equ 083Bh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned P2DCST                 :1;
        unsigned P2DCSC1                :1;
        unsigned P2DCSC2                :1;
        unsigned P2DCSC3                :1;
        unsigned P2DCSC4                :1;
        unsigned                        :2;
        unsigned P2DCSIN                :1;
    };
} PSMC2DCSbits_t;
extern volatile PSMC2DCSbits_t PSMC2DCSbits __at(0x83B);
// bitfield macros
#define _PSMC2DCS_P2DCST_POSN                               0x0
#define _PSMC2DCS_P2DCST_POSITION                           0x0
#define _PSMC2DCS_P2DCST_SIZE                               0x1
#define _PSMC2DCS_P2DCST_LENGTH                             0x1
#define _PSMC2DCS_P2DCST_MASK                               0x1
#define _PSMC2DCS_P2DCSC1_POSN                              0x1
#define _PSMC2DCS_P2DCSC1_POSITION                          0x1
#define _PSMC2DCS_P2DCSC1_SIZE                              0x1
#define _PSMC2DCS_P2DCSC1_LENGTH                            0x1
#define _PSMC2DCS_P2DCSC1_MASK                              0x2
#define _PSMC2DCS_P2DCSC2_POSN                              0x2
#define _PSMC2DCS_P2DCSC2_POSITION                          0x2
#define _PSMC2DCS_P2DCSC2_SIZE                              0x1
#define _PSMC2DCS_P2DCSC2_LENGTH                            0x1
#define _PSMC2DCS_P2DCSC2_MASK                              0x4
#define _PSMC2DCS_P2DCSC3_POSN                              0x3
#define _PSMC2DCS_P2DCSC3_POSITION                          0x3
#define _PSMC2DCS_P2DCSC3_SIZE                              0x1
#define _PSMC2DCS_P2DCSC3_LENGTH                            0x1
#define _PSMC2DCS_P2DCSC3_MASK                              0x8
#define _PSMC2DCS_P2DCSC4_POSN                              0x4
#define _PSMC2DCS_P2DCSC4_POSITION                          0x4
#define _PSMC2DCS_P2DCSC4_SIZE                              0x1
#define _PSMC2DCS_P2DCSC4_LENGTH                            0x1
#define _PSMC2DCS_P2DCSC4_MASK                              0x10
#define _PSMC2DCS_P2DCSIN_POSN                              0x7
#define _PSMC2DCS_P2DCSIN_POSITION                          0x7
#define _PSMC2DCS_P2DCSIN_SIZE                              0x1
#define _PSMC2DCS_P2DCSIN_LENGTH                            0x1
#define _PSMC2DCS_P2DCSIN_MASK                              0x80

// Register: PSMC2PRS
#define PSMC2PRS PSMC2PRS
extern volatile unsigned char           PSMC2PRS            __at(0x83C);
#ifndef _LIB_BUILD
asm("PSMC2PRS equ 083Ch");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned P2PRST                 :1;
        unsigned P2PRSC1                :1;
        unsigned P2PRSC2                :1;
        unsigned P2PRSC3                :1;
        unsigned P2PRSC4                :1;
        unsigned                        :2;
        unsigned P2PRSIN                :1;
    };
} PSMC2PRSbits_t;
