MikroElektronika/core_packages/PIC/XC8/def/PIC16LF1786/mcu.h
#define                                 P1PRSIN_bit         _BIT_ACCESS(PSMC1PRS,7)
// PSMC1PRS<P1PRST>
extern volatile __bit                   P1PRST              __at(0x40E0);	// @ (0x81C * 8 + 0)
#define                                 P1PRST_bit          _BIT_ACCESS(PSMC1PRS,0)
// PSMC1BLNK<P1REBM0>
extern volatile __bit                   P1REBM0             __at(0x40B8);	// @ (0x817 * 8 + 0)
#define                                 P1REBM0_bit         _BIT_ACCESS(PSMC1BLNK,0)
// PSMC1BLNK<P1REBM1>
extern volatile __bit                   P1REBM1             __at(0x40B9);	// @ (0x817 * 8 + 1)
#define                                 P1REBM1_bit         _BIT_ACCESS(PSMC1BLNK,1)
// PSMC1REBS<P1REBSC1>
extern volatile __bit                   P1REBSC1            __at(0x40C1);	// @ (0x818 * 8 + 1)
#define                                 P1REBSC1_bit        _BIT_ACCESS(PSMC1REBS,1)
// PSMC1REBS<P1REBSC2>
extern volatile __bit                   P1REBSC2            __at(0x40C2);	// @ (0x818 * 8 + 2)
#define                                 P1REBSC2_bit        _BIT_ACCESS(PSMC1REBS,2)
// PSMC1REBS<P1REBSC3>
extern volatile __bit                   P1REBSC3            __at(0x40C3);	// @ (0x818 * 8 + 3)
#define                                 P1REBSC3_bit        _BIT_ACCESS(PSMC1REBS,3)
// PSMC1REBS<P1REBSC4>
extern volatile __bit                   P1REBSC4            __at(0x40C4);	// @ (0x818 * 8 + 4)
#define                                 P1REBSC4_bit        _BIT_ACCESS(PSMC1REBS,4)
// PSMC1REBS<P1REBSIN>
extern volatile __bit                   P1REBSIN            __at(0x40C7);	// @ (0x818 * 8 + 7)
#define                                 P1REBSIN_bit        _BIT_ACCESS(PSMC1REBS,7)
// PSMC1STR1<P1SSYNC>
extern volatile __bit                   P1SSYNC             __at(0x417F);	// @ (0x82F * 8 + 7)
#define                                 P1SSYNC_bit         _BIT_ACCESS(PSMC1STR1,7)
// PSMC1STR0<P1STRA>
extern volatile __bit                   P1STRA              __at(0x4170);	// @ (0x82E * 8 + 0)
#define                                 P1STRA_bit          _BIT_ACCESS(PSMC1STR0,0)
// PSMC1STR0<P1STRB>
extern volatile __bit                   P1STRB              __at(0x4171);	// @ (0x82E * 8 + 1)
#define                                 P1STRB_bit          _BIT_ACCESS(PSMC1STR0,1)
// PSMC1STR0<P1STRC>
extern volatile __bit                   P1STRC              __at(0x4172);	// @ (0x82E * 8 + 2)
#define                                 P1STRC_bit          _BIT_ACCESS(PSMC1STR0,2)
// PSMC1STR0<P1STRD>
extern volatile __bit                   P1STRD              __at(0x4173);	// @ (0x82E * 8 + 3)
#define                                 P1STRD_bit          _BIT_ACCESS(PSMC1STR0,3)
// PSMC1STR0<P1STRE>
extern volatile __bit                   P1STRE              __at(0x4174);	// @ (0x82E * 8 + 4)
#define                                 P1STRE_bit          _BIT_ACCESS(PSMC1STR0,4)
// PSMC1STR0<P1STRF>
extern volatile __bit                   P1STRF              __at(0x4175);	// @ (0x82E * 8 + 5)
#define                                 P1STRF_bit          _BIT_ACCESS(PSMC1STR0,5)
// PSMC1SYNC<P1SYNC0>
extern volatile __bit                   P1SYNC0             __at(0x4098);	// @ (0x813 * 8 + 0)
#define                                 P1SYNC0_bit         _BIT_ACCESS(PSMC1SYNC,0)
// PSMC1SYNC<P1SYNC1>
extern volatile __bit                   P1SYNC1             __at(0x4099);	// @ (0x813 * 8 + 1)
#define                                 P1SYNC1_bit         _BIT_ACCESS(PSMC1SYNC,1)
// PSMC1SYNC<P1SYNC2>
extern volatile __bit                   P1SYNC2             __at(0x409A);	// @ (0x813 * 8 + 2)
#define                                 P1SYNC2_bit         _BIT_ACCESS(PSMC1SYNC,2)
// PSMC1INT<P1TDCIE>
extern volatile __bit                   P1TDCIE             __at(0x4105);	// @ (0x820 * 8 + 5)
#define                                 P1TDCIE_bit         _BIT_ACCESS(PSMC1INT,5)
// PSMC1INT<P1TDCIF>
extern volatile __bit                   P1TDCIF             __at(0x4101);	// @ (0x820 * 8 + 1)
#define                                 P1TDCIF_bit         _BIT_ACCESS(PSMC1INT,1)
// PSMC1INT<P1TOVIE>
extern volatile __bit                   P1TOVIE             __at(0x4107);	// @ (0x820 * 8 + 7)
#define                                 P1TOVIE_bit         _BIT_ACCESS(PSMC1INT,7)
// PSMC1INT<P1TOVIF>
extern volatile __bit                   P1TOVIF             __at(0x4103);	// @ (0x820 * 8 + 3)
#define                                 P1TOVIF_bit         _BIT_ACCESS(PSMC1INT,3)
// PSMC1INT<P1TPHIE>
extern volatile __bit                   P1TPHIE             __at(0x4106);	// @ (0x820 * 8 + 6)
#define                                 P1TPHIE_bit         _BIT_ACCESS(PSMC1INT,6)
// PSMC1INT<P1TPHIF>
extern volatile __bit                   P1TPHIF             __at(0x4102);	// @ (0x820 * 8 + 2)
#define                                 P1TPHIF_bit         _BIT_ACCESS(PSMC1INT,2)
// PSMC1INT<P1TPRIE>
extern volatile __bit                   P1TPRIE             __at(0x4104);	// @ (0x820 * 8 + 4)
#define                                 P1TPRIE_bit         _BIT_ACCESS(PSMC1INT,4)
// PSMC1INT<P1TPRIF>
extern volatile __bit                   P1TPRIF             __at(0x4100);	// @ (0x820 * 8 + 0)
#define                                 P1TPRIF_bit         _BIT_ACCESS(PSMC1INT,0)
// PSMC2ASDC<P2ARSEN>
extern volatile __bit                   P2ARSEN             __at(0x41ED);	// @ (0x83D * 8 + 5)
#define                                 P2ARSEN_bit         _BIT_ACCESS(PSMC2ASDC,5)
// PSMC2ASDC<P2ASDEN>
extern volatile __bit                   P2ASDEN             __at(0x41EE);	// @ (0x83D * 8 + 6)
#define                                 P2ASDEN_bit         _BIT_ACCESS(PSMC2ASDC,6)
// PSMC2ASDL<P2ASDLA>
extern volatile __bit                   P2ASDLA             __at(0x41F0);	// @ (0x83E * 8 + 0)
#define                                 P2ASDLA_bit         _BIT_ACCESS(PSMC2ASDL,0)
// PSMC2ASDL<P2ASDLB>
extern volatile __bit                   P2ASDLB             __at(0x41F1);	// @ (0x83E * 8 + 1)
#define                                 P2ASDLB_bit         _BIT_ACCESS(PSMC2ASDL,1)
// PSMC2ASDC<P2ASDOV>
extern volatile __bit                   P2ASDOV             __at(0x41E8);	// @ (0x83D * 8 + 0)
#define                                 P2ASDOV_bit         _BIT_ACCESS(PSMC2ASDC,0)
// PSMC2ASDS<P2ASDSC1>
extern volatile __bit                   P2ASDSC1            __at(0x41F9);	// @ (0x83F * 8 + 1)
#define                                 P2ASDSC1_bit        _BIT_ACCESS(PSMC2ASDS,1)
// PSMC2ASDS<P2ASDSC2>
extern volatile __bit                   P2ASDSC2            __at(0x41FA);	// @ (0x83F * 8 + 2)
#define                                 P2ASDSC2_bit        _BIT_ACCESS(PSMC2ASDS,2)
// PSMC2ASDS<P2ASDSC3>
extern volatile __bit                   P2ASDSC3            __at(0x41FB);	// @ (0x83F * 8 + 3)
#define                                 P2ASDSC3_bit        _BIT_ACCESS(PSMC2ASDS,3)
// PSMC2ASDS<P2ASDSC4>
extern volatile __bit                   P2ASDSC4            __at(0x41FC);	// @ (0x83F * 8 + 4)
#define                                 P2ASDSC4_bit        _BIT_ACCESS(PSMC2ASDS,4)
// PSMC2ASDS<P2ASDSIN>
extern volatile __bit                   P2ASDSIN            __at(0x41FF);	// @ (0x83F * 8 + 7)
#define                                 P2ASDSIN_bit        _BIT_ACCESS(PSMC2ASDS,7)
// PSMC2ASDC<P2ASE>
extern volatile __bit                   P2ASE               __at(0x41EF);	// @ (0x83D * 8 + 7)
#define                                 P2ASE_bit           _BIT_ACCESS(PSMC2ASDC,7)
// PSMC2CLK<P2CPRE0>
extern volatile __bit                   P2CPRE0             __at(0x41A4);	// @ (0x834 * 8 + 4)
#define                                 P2CPRE0_bit         _BIT_ACCESS(PSMC2CLK,4)
// PSMC2CLK<P2CPRE1>
extern volatile __bit                   P2CPRE1             __at(0x41A5);	// @ (0x834 * 8 + 5)
#define                                 P2CPRE1_bit         _BIT_ACCESS(PSMC2CLK,5)
// PSMC2CLK<P2CSRC0>
extern volatile __bit                   P2CSRC0             __at(0x41A0);	// @ (0x834 * 8 + 0)
#define                                 P2CSRC0_bit         _BIT_ACCESS(PSMC2CLK,0)
// PSMC2CLK<P2CSRC1>
extern volatile __bit                   P2CSRC1             __at(0x41A1);	// @ (0x834 * 8 + 1)
#define                                 P2CSRC1_bit         _BIT_ACCESS(PSMC2CLK,1)
// PSMC2CON<P2DBFE>
extern volatile __bit                   P2DBFE              __at(0x418D);	// @ (0x831 * 8 + 5)
#define                                 P2DBFE_bit          _BIT_ACCESS(PSMC2CON,5)
// PSMC2CON<P2DBRE>
extern volatile __bit                   P2DBRE              __at(0x418C);	// @ (0x831 * 8 + 4)
#define                                 P2DBRE_bit          _BIT_ACCESS(PSMC2CON,4)
// PSMC2SYNC<P2DCPOL>
extern volatile __bit                   P2DCPOL             __at(0x419D);	// @ (0x833 * 8 + 5)
#define                                 P2DCPOL_bit         _BIT_ACCESS(PSMC2SYNC,5)
// PSMC2DCS<P2DCSC1>
extern volatile __bit                   P2DCSC1             __at(0x41D9);	// @ (0x83B * 8 + 1)
#define                                 P2DCSC1_bit         _BIT_ACCESS(PSMC2DCS,1)
// PSMC2DCS<P2DCSC2>
extern volatile __bit                   P2DCSC2             __at(0x41DA);	// @ (0x83B * 8 + 2)
#define                                 P2DCSC2_bit         _BIT_ACCESS(PSMC2DCS,2)
// PSMC2DCS<P2DCSC3>
extern volatile __bit                   P2DCSC3             __at(0x41DB);	// @ (0x83B * 8 + 3)
#define                                 P2DCSC3_bit         _BIT_ACCESS(PSMC2DCS,3)
// PSMC2DCS<P2DCSC4>
extern volatile __bit                   P2DCSC4             __at(0x41DC);	// @ (0x83B * 8 + 4)
#define                                 P2DCSC4_bit         _BIT_ACCESS(PSMC2DCS,4)
// PSMC2DCS<P2DCSIN>
extern volatile __bit                   P2DCSIN             __at(0x41DF);	// @ (0x83B * 8 + 7)
#define                                 P2DCSIN_bit         _BIT_ACCESS(PSMC2DCS,7)
// PSMC2DCS<P2DCST>
extern volatile __bit                   P2DCST              __at(0x41D8);	// @ (0x83B * 8 + 0)
#define                                 P2DCST_bit          _BIT_ACCESS(PSMC2DCS,0)
// PSMC2BLNK<P2FEBM0>
extern volatile __bit                   P2FEBM0             __at(0x41BC);	// @ (0x837 * 8 + 4)
#define                                 P2FEBM0_bit         _BIT_ACCESS(PSMC2BLNK,4)
// PSMC2BLNK<P2FEBM1>
extern volatile __bit                   P2FEBM1             __at(0x41BD);	// @ (0x837 * 8 + 5)
#define                                 P2FEBM1_bit         _BIT_ACCESS(PSMC2BLNK,5)
// PSMC2FEBS<P2FEBSC1>
extern volatile __bit                   P2FEBSC1            __at(0x41C9);	// @ (0x839 * 8 + 1)
#define                                 P2FEBSC1_bit        _BIT_ACCESS(PSMC2FEBS,1)
// PSMC2FEBS<P2FEBSC2>
extern volatile __bit                   P2FEBSC2            __at(0x41CA);	// @ (0x839 * 8 + 2)
#define                                 P2FEBSC2_bit        _BIT_ACCESS(PSMC2FEBS,2)
// PSMC2FEBS<P2FEBSC3>
extern volatile __bit                   P2FEBSC3            __at(0x41CB);	// @ (0x839 * 8 + 3)
#define                                 P2FEBSC3_bit        _BIT_ACCESS(PSMC2FEBS,3)
// PSMC2FEBS<P2FEBSC4>
extern volatile __bit                   P2FEBSC4            __at(0x41CC);	// @ (0x839 * 8 + 4)
#define                                 P2FEBSC4_bit        _BIT_ACCESS(PSMC2FEBS,4)
// PSMC2FEBS<P2FEBSIN>
extern volatile __bit                   P2FEBSIN            __at(0x41CF);	// @ (0x839 * 8 + 7)
#define                                 P2FEBSIN_bit        _BIT_ACCESS(PSMC2FEBS,7)
// PSMC2STR1<P2HSMEN>
extern volatile __bit                   P2HSMEN             __at(0x4278);	// @ (0x84F * 8 + 0)
#define                                 P2HSMEN_bit         _BIT_ACCESS(PSMC2STR1,0)
// PSMC2POL<P2INPOL>
extern volatile __bit                   P2INPOL             __at(0x41B6);	// @ (0x836 * 8 + 6)
#define                                 P2INPOL_bit         _BIT_ACCESS(PSMC2POL,6)
// PSMC2STR1<P2LSMEN>
extern volatile __bit                   P2LSMEN             __at(0x4279);	// @ (0x84F * 8 + 1)
#define                                 P2LSMEN_bit         _BIT_ACCESS(PSMC2STR1,1)
// PSMC2MDL<P2MDLBIT>
extern volatile __bit                   P2MDLBIT            __at(0x4195);	// @ (0x832 * 8 + 5)
#define                                 P2MDLBIT_bit        _BIT_ACCESS(PSMC2MDL,5)
// PSMC2MDL<P2MDLEN>
extern volatile __bit                   P2MDLEN             __at(0x4197);	// @ (0x832 * 8 + 7)
#define                                 P2MDLEN_bit         _BIT_ACCESS(PSMC2MDL,7)
// PSMC2MDL<P2MDLPOL>
extern volatile __bit                   P2MDLPOL            __at(0x4196);	// @ (0x832 * 8 + 6)
#define                                 P2MDLPOL_bit        _BIT_ACCESS(PSMC2MDL,6)
// PSMC2CON<P2MODE0>
extern volatile __bit                   P2MODE0             __at(0x4188);	// @ (0x831 * 8 + 0)
#define                                 P2MODE0_bit         _BIT_ACCESS(PSMC2CON,0)
// PSMC2CON<P2MODE1>
extern volatile __bit                   P2MODE1             __at(0x4189);	// @ (0x831 * 8 + 1)
#define                                 P2MODE1_bit         _BIT_ACCESS(PSMC2CON,1)
// PSMC2CON<P2MODE2>
extern volatile __bit                   P2MODE2             __at(0x418A);	// @ (0x831 * 8 + 2)
#define                                 P2MODE2_bit         _BIT_ACCESS(PSMC2CON,2)
// PSMC2CON<P2MODE3>
extern volatile __bit                   P2MODE3             __at(0x418B);	// @ (0x831 * 8 + 3)
#define                                 P2MODE3_bit         _BIT_ACCESS(PSMC2CON,3)
// PSMC2MDL<P2MSRC0>
extern volatile __bit                   P2MSRC0             __at(0x4190);	// @ (0x832 * 8 + 0)
#define                                 P2MSRC0_bit         _BIT_ACCESS(PSMC2MDL,0)
// PSMC2MDL<P2MSRC1>
extern volatile __bit                   P2MSRC1             __at(0x4191);	// @ (0x832 * 8 + 1)
#define                                 P2MSRC1_bit         _BIT_ACCESS(PSMC2MDL,1)
// PSMC2MDL<P2MSRC2>
extern volatile __bit                   P2MSRC2             __at(0x4192);	// @ (0x832 * 8 + 2)
#define                                 P2MSRC2_bit         _BIT_ACCESS(PSMC2MDL,2)
// PSMC2MDL<P2MSRC3>
extern volatile __bit                   P2MSRC3             __at(0x4193);	// @ (0x832 * 8 + 3)
#define                                 P2MSRC3_bit         _BIT_ACCESS(PSMC2MDL,3)
// PSMC2OEN<P2OEA>
extern volatile __bit                   P2OEA               __at(0x41A8);	// @ (0x835 * 8 + 0)
#define                                 P2OEA_bit           _BIT_ACCESS(PSMC2OEN,0)
// PSMC2OEN<P2OEB>
extern volatile __bit                   P2OEB               __at(0x41A9);	// @ (0x835 * 8 + 1)
#define                                 P2OEB_bit           _BIT_ACCESS(PSMC2OEN,1)
// PSMC2PHS<P2PHSC1>
extern volatile __bit                   P2PHSC1             __at(0x41D1);	// @ (0x83A * 8 + 1)
#define                                 P2PHSC1_bit         _BIT_ACCESS(PSMC2PHS,1)
// PSMC2PHS<P2PHSC2>
extern volatile __bit                   P2PHSC2             __at(0x41D2);	// @ (0x83A * 8 + 2)
#define                                 P2PHSC2_bit         _BIT_ACCESS(PSMC2PHS,2)
// PSMC2PHS<P2PHSC3>
extern volatile __bit                   P2PHSC3             __at(0x41D3);	// @ (0x83A * 8 + 3)
#define                                 P2PHSC3_bit         _BIT_ACCESS(PSMC2PHS,3)
// PSMC2PHS<P2PHSC4>
extern volatile __bit                   P2PHSC4             __at(0x41D4);	// @ (0x83A * 8 + 4)
#define                                 P2PHSC4_bit         _BIT_ACCESS(PSMC2PHS,4)
// PSMC2PHS<P2PHSIN>
extern volatile __bit                   P2PHSIN             __at(0x41D7);	// @ (0x83A * 8 + 7)
#define                                 P2PHSIN_bit         _BIT_ACCESS(PSMC2PHS,7)
// PSMC2PHS<P2PHST>
extern volatile __bit                   P2PHST              __at(0x41D0);	// @ (0x83A * 8 + 0)
#define                                 P2PHST_bit          _BIT_ACCESS(PSMC2PHS,0)
// PSMC2SYNC<P2POFST>
extern volatile __bit                   P2POFST             __at(0x419F);	// @ (0x833 * 8 + 7)
#define                                 P2POFST_bit         _BIT_ACCESS(PSMC2SYNC,7)
// PSMC2POL<P2POLA>
extern volatile __bit                   P2POLA              __at(0x41B0);	// @ (0x836 * 8 + 0)
#define                                 P2POLA_bit          _BIT_ACCESS(PSMC2POL,0)
// PSMC2POL<P2POLB>
extern volatile __bit                   P2POLB              __at(0x41B1);	// @ (0x836 * 8 + 1)
#define                                 P2POLB_bit          _BIT_ACCESS(PSMC2POL,1)
// PSMC2SYNC<P2PRPOL>
extern volatile __bit                   P2PRPOL             __at(0x419E);	// @ (0x833 * 8 + 6)
#define                                 P2PRPOL_bit         _BIT_ACCESS(PSMC2SYNC,6)
// PSMC2PRS<P2PRSC1>
extern volatile __bit                   P2PRSC1             __at(0x41E1);	// @ (0x83C * 8 + 1)
#define                                 P2PRSC1_bit         _BIT_ACCESS(PSMC2PRS,1)
// PSMC2PRS<P2PRSC2>
extern volatile __bit                   P2PRSC2             __at(0x41E2);	// @ (0x83C * 8 + 2)
#define                                 P2PRSC2_bit         _BIT_ACCESS(PSMC2PRS,2)
// PSMC2PRS<P2PRSC3>
extern volatile __bit                   P2PRSC3             __at(0x41E3);	// @ (0x83C * 8 + 3)
#define                                 P2PRSC3_bit         _BIT_ACCESS(PSMC2PRS,3)
// PSMC2PRS<P2PRSC4>
extern volatile __bit                   P2PRSC4             __at(0x41E4);	// @ (0x83C * 8 + 4)
#define                                 P2PRSC4_bit         _BIT_ACCESS(PSMC2PRS,4)
// PSMC2PRS<P2PRSIN>
extern volatile __bit                   P2PRSIN             __at(0x41E7);	// @ (0x83C * 8 + 7)
#define                                 P2PRSIN_bit         _BIT_ACCESS(PSMC2PRS,7)
// PSMC2PRS<P2PRST>
extern volatile __bit                   P2PRST              __at(0x41E0);	// @ (0x83C * 8 + 0)
#define                                 P2PRST_bit          _BIT_ACCESS(PSMC2PRS,0)
// PSMC2BLNK<P2REBM0>
extern volatile __bit                   P2REBM0             __at(0x41B8);	// @ (0x837 * 8 + 0)
#define                                 P2REBM0_bit         _BIT_ACCESS(PSMC2BLNK,0)
// PSMC2BLNK<P2REBM1>
extern volatile __bit                   P2REBM1             __at(0x41B9);	// @ (0x837 * 8 + 1)
#define                                 P2REBM1_bit         _BIT_ACCESS(PSMC2BLNK,1)
// PSMC2REBS<P2REBSC1>
extern volatile __bit                   P2REBSC1            __at(0x41C1);	// @ (0x838 * 8 + 1)
#define                                 P2REBSC1_bit        _BIT_ACCESS(PSMC2REBS,1)
// PSMC2REBS<P2REBSC2>
extern volatile __bit                   P2REBSC2            __at(0x41C2);	// @ (0x838 * 8 + 2)
#define                                 P2REBSC2_bit        _BIT_ACCESS(PSMC2REBS,2)
// PSMC2REBS<P2REBSC3>
extern volatile __bit                   P2REBSC3            __at(0x41C3);	// @ (0x838 * 8 + 3)
#define                                 P2REBSC3_bit        _BIT_ACCESS(PSMC2REBS,3)
// PSMC2REBS<P2REBSC4>
extern volatile __bit                   P2REBSC4            __at(0x41C4);	// @ (0x838 * 8 + 4)
#define                                 P2REBSC4_bit        _BIT_ACCESS(PSMC2REBS,4)
// PSMC2REBS<P2REBSIN>
extern volatile __bit                   P2REBSIN            __at(0x41C7);	// @ (0x838 * 8 + 7)
#define                                 P2REBSIN_bit        _BIT_ACCESS(PSMC2REBS,7)
// PSMC2STR1<P2SSYNC>
extern volatile __bit                   P2SSYNC             __at(0x427F);	// @ (0x84F * 8 + 7)
#define                                 P2SSYNC_bit         _BIT_ACCESS(PSMC2STR1,7)
// PSMC2STR0<P2STRA>
extern volatile __bit                   P2STRA              __at(0x4270);	// @ (0x84E * 8 + 0)
#define                                 P2STRA_bit          _BIT_ACCESS(PSMC2STR0,0)
// PSMC2STR0<P2STRB>
extern volatile __bit                   P2STRB              __at(0x4271);	// @ (0x84E * 8 + 1)
#define                                 P2STRB_bit          _BIT_ACCESS(PSMC2STR0,1)
// PSMC2SYNC<P2SYNC0>
extern volatile __bit                   P2SYNC0             __at(0x4198);	// @ (0x833 * 8 + 0)
#define                                 P2SYNC0_bit         _BIT_ACCESS(PSMC2SYNC,0)
// PSMC2SYNC<P2SYNC1>
extern volatile __bit                   P2SYNC1             __at(0x4199);	// @ (0x833 * 8 + 1)
#define                                 P2SYNC1_bit         _BIT_ACCESS(PSMC2SYNC,1)
// PSMC2SYNC<P2SYNC2>
extern volatile __bit                   P2SYNC2             __at(0x419A);	// @ (0x833 * 8 + 2)
#define                                 P2SYNC2_bit         _BIT_ACCESS(PSMC2SYNC,2)
// PSMC2INT<P2TDCIE>
extern volatile __bit                   P2TDCIE             __at(0x4205);	// @ (0x840 * 8 + 5)
#define                                 P2TDCIE_bit         _BIT_ACCESS(PSMC2INT,5)
// PSMC2INT<P2TDCIF>
extern volatile __bit                   P2TDCIF             __at(0x4201);	// @ (0x840 * 8 + 1)
#define                                 P2TDCIF_bit         _BIT_ACCESS(PSMC2INT,1)
// PSMC2INT<P2TOVIE>
extern volatile __bit                   P2TOVIE             __at(0x4207);	// @ (0x840 * 8 + 7)
#define                                 P2TOVIE_bit         _BIT_ACCESS(PSMC2INT,7)
// PSMC2INT<P2TOVIF>
extern volatile __bit                   P2TOVIF             __at(0x4203);	// @ (0x840 * 8 + 3)
#define                                 P2TOVIF_bit         _BIT_ACCESS(PSMC2INT,3)
// PSMC2INT<P2TPHIE>
extern volatile __bit                   P2TPHIE             __at(0x4206);	// @ (0x840 * 8 + 6)
#define                                 P2TPHIE_bit         _BIT_ACCESS(PSMC2INT,6)
// PSMC2INT<P2TPHIF>
extern volatile __bit                   P2TPHIF             __at(0x4202);	// @ (0x840 * 8 + 2)
#define                                 P2TPHIF_bit         _BIT_ACCESS(PSMC2INT,2)
// PSMC2INT<P2TPRIE>
extern volatile __bit                   P2TPRIE             __at(0x4204);	// @ (0x840 * 8 + 4)
#define                                 P2TPRIE_bit         _BIT_ACCESS(PSMC2INT,4)
// PSMC2INT<P2TPRIF>
extern volatile __bit                   P2TPRIF             __at(0x4200);	// @ (0x840 * 8 + 0)
#define                                 P2TPRIF_bit         _BIT_ACCESS(PSMC2INT,0)
// PSMC3ASDC<P3ARSEN>
extern volatile __bit                   P3ARSEN             __at(0x42ED);	// @ (0x85D * 8 + 5)
#define                                 P3ARSEN_bit         _BIT_ACCESS(PSMC3ASDC,5)
// PSMC3ASDC<P3ASDEN>
extern volatile __bit                   P3ASDEN             __at(0x42EE);	// @ (0x85D * 8 + 6)
#define                                 P3ASDEN_bit         _BIT_ACCESS(PSMC3ASDC,6)
// PSMC3ASDL<P3ASDLA>
extern volatile __bit                   P3ASDLA             __at(0x42F0);	// @ (0x85E * 8 + 0)
#define                                 P3ASDLA_bit         _BIT_ACCESS(PSMC3ASDL,0)
// PSMC3ASDL<P3ASDLB>
extern volatile __bit                   P3ASDLB             __at(0x42F1);	// @ (0x85E * 8 + 1)
#define                                 P3ASDLB_bit         _BIT_ACCESS(PSMC3ASDL,1)
// PSMC3ASDL<P3ASDLC>
extern volatile __bit                   P3ASDLC             __at(0x42F2);	// @ (0x85E * 8 + 2)
#define                                 P3ASDLC_bit         _BIT_ACCESS(PSMC3ASDL,2)
// PSMC3ASDL<P3ASDLD>
extern volatile __bit                   P3ASDLD             __at(0x42F3);	// @ (0x85E * 8 + 3)
#define                                 P3ASDLD_bit         _BIT_ACCESS(PSMC3ASDL,3)
// PSMC3ASDL<P3ASDLE>
extern volatile __bit                   P3ASDLE             __at(0x42F4);	// @ (0x85E * 8 + 4)
#define                                 P3ASDLE_bit         _BIT_ACCESS(PSMC3ASDL,4)
// PSMC3ASDL<P3ASDLF>
extern volatile __bit                   P3ASDLF             __at(0x42F5);	// @ (0x85E * 8 + 5)
#define                                 P3ASDLF_bit         _BIT_ACCESS(PSMC3ASDL,5)
// PSMC3ASDC<P3ASDOV>
extern volatile __bit                   P3ASDOV             __at(0x42E8);	// @ (0x85D * 8 + 0)
