MikroElektronika/core_packages/PIC/XC8/def/PIC16LF1786/mcu.h
#define                                 P3ASDOV_bit         _BIT_ACCESS(PSMC3ASDC,0)
// PSMC3ASDS<P3ASDSC1>
extern volatile __bit                   P3ASDSC1            __at(0x42F9);	// @ (0x85F * 8 + 1)
#define                                 P3ASDSC1_bit        _BIT_ACCESS(PSMC3ASDS,1)
// PSMC3ASDS<P3ASDSC2>
extern volatile __bit                   P3ASDSC2            __at(0x42FA);	// @ (0x85F * 8 + 2)
#define                                 P3ASDSC2_bit        _BIT_ACCESS(PSMC3ASDS,2)
// PSMC3ASDS<P3ASDSC3>
extern volatile __bit                   P3ASDSC3            __at(0x42FB);	// @ (0x85F * 8 + 3)
#define                                 P3ASDSC3_bit        _BIT_ACCESS(PSMC3ASDS,3)
// PSMC3ASDS<P3ASDSC4>
extern volatile __bit                   P3ASDSC4            __at(0x42FC);	// @ (0x85F * 8 + 4)
#define                                 P3ASDSC4_bit        _BIT_ACCESS(PSMC3ASDS,4)
// PSMC3ASDS<P3ASDSIN>
extern volatile __bit                   P3ASDSIN            __at(0x42FF);	// @ (0x85F * 8 + 7)
#define                                 P3ASDSIN_bit        _BIT_ACCESS(PSMC3ASDS,7)
// PSMC3ASDC<P3ASE>
extern volatile __bit                   P3ASE               __at(0x42EF);	// @ (0x85D * 8 + 7)
#define                                 P3ASE_bit           _BIT_ACCESS(PSMC3ASDC,7)
// PSMC3CLK<P3CPRE0>
extern volatile __bit                   P3CPRE0             __at(0x42A4);	// @ (0x854 * 8 + 4)
#define                                 P3CPRE0_bit         _BIT_ACCESS(PSMC3CLK,4)
// PSMC3CLK<P3CPRE1>
extern volatile __bit                   P3CPRE1             __at(0x42A5);	// @ (0x854 * 8 + 5)
#define                                 P3CPRE1_bit         _BIT_ACCESS(PSMC3CLK,5)
// PSMC3CLK<P3CSRC0>
extern volatile __bit                   P3CSRC0             __at(0x42A0);	// @ (0x854 * 8 + 0)
#define                                 P3CSRC0_bit         _BIT_ACCESS(PSMC3CLK,0)
// PSMC3CLK<P3CSRC1>
extern volatile __bit                   P3CSRC1             __at(0x42A1);	// @ (0x854 * 8 + 1)
#define                                 P3CSRC1_bit         _BIT_ACCESS(PSMC3CLK,1)
// PSMC3CON<P3DBFE>
extern volatile __bit                   P3DBFE              __at(0x428D);	// @ (0x851 * 8 + 5)
#define                                 P3DBFE_bit          _BIT_ACCESS(PSMC3CON,5)
// PSMC3CON<P3DBRE>
extern volatile __bit                   P3DBRE              __at(0x428C);	// @ (0x851 * 8 + 4)
#define                                 P3DBRE_bit          _BIT_ACCESS(PSMC3CON,4)
// PSMC3SYNC<P3DCPOL>
extern volatile __bit                   P3DCPOL             __at(0x429D);	// @ (0x853 * 8 + 5)
#define                                 P3DCPOL_bit         _BIT_ACCESS(PSMC3SYNC,5)
// PSMC3DCS<P3DCSC1>
extern volatile __bit                   P3DCSC1             __at(0x42D9);	// @ (0x85B * 8 + 1)
#define                                 P3DCSC1_bit         _BIT_ACCESS(PSMC3DCS,1)
// PSMC3DCS<P3DCSC2>
extern volatile __bit                   P3DCSC2             __at(0x42DA);	// @ (0x85B * 8 + 2)
#define                                 P3DCSC2_bit         _BIT_ACCESS(PSMC3DCS,2)
// PSMC3DCS<P3DCSC3>
extern volatile __bit                   P3DCSC3             __at(0x42DB);	// @ (0x85B * 8 + 3)
#define                                 P3DCSC3_bit         _BIT_ACCESS(PSMC3DCS,3)
// PSMC3DCS<P3DCSC4>
extern volatile __bit                   P3DCSC4             __at(0x42DC);	// @ (0x85B * 8 + 4)
#define                                 P3DCSC4_bit         _BIT_ACCESS(PSMC3DCS,4)
// PSMC3DCS<P3DCSIN>
extern volatile __bit                   P3DCSIN             __at(0x42DF);	// @ (0x85B * 8 + 7)
#define                                 P3DCSIN_bit         _BIT_ACCESS(PSMC3DCS,7)
// PSMC3DCS<P3DCST>
extern volatile __bit                   P3DCST              __at(0x42D8);	// @ (0x85B * 8 + 0)
#define                                 P3DCST_bit          _BIT_ACCESS(PSMC3DCS,0)
// PSMC3BLNK<P3FEBM0>
extern volatile __bit                   P3FEBM0             __at(0x42BC);	// @ (0x857 * 8 + 4)
#define                                 P3FEBM0_bit         _BIT_ACCESS(PSMC3BLNK,4)
// PSMC3BLNK<P3FEBM1>
extern volatile __bit                   P3FEBM1             __at(0x42BD);	// @ (0x857 * 8 + 5)
#define                                 P3FEBM1_bit         _BIT_ACCESS(PSMC3BLNK,5)
// PSMC3FEBS<P3FEBSC1>
extern volatile __bit                   P3FEBSC1            __at(0x42C9);	// @ (0x859 * 8 + 1)
#define                                 P3FEBSC1_bit        _BIT_ACCESS(PSMC3FEBS,1)
// PSMC3FEBS<P3FEBSC2>
extern volatile __bit                   P3FEBSC2            __at(0x42CA);	// @ (0x859 * 8 + 2)
#define                                 P3FEBSC2_bit        _BIT_ACCESS(PSMC3FEBS,2)
// PSMC3FEBS<P3FEBSC3>
extern volatile __bit                   P3FEBSC3            __at(0x42CB);	// @ (0x859 * 8 + 3)
#define                                 P3FEBSC3_bit        _BIT_ACCESS(PSMC3FEBS,3)
// PSMC3FEBS<P3FEBSC4>
extern volatile __bit                   P3FEBSC4            __at(0x42CC);	// @ (0x859 * 8 + 4)
#define                                 P3FEBSC4_bit        _BIT_ACCESS(PSMC3FEBS,4)
// PSMC3FEBS<P3FEBSIN>
extern volatile __bit                   P3FEBSIN            __at(0x42CF);	// @ (0x859 * 8 + 7)
#define                                 P3FEBSIN_bit        _BIT_ACCESS(PSMC3FEBS,7)
// PSMC3STR1<P3HSMEN>
extern volatile __bit                   P3HSMEN             __at(0x4378);	// @ (0x86F * 8 + 0)
#define                                 P3HSMEN_bit         _BIT_ACCESS(PSMC3STR1,0)
// PSMC3POL<P3INPOL>
extern volatile __bit                   P3INPOL             __at(0x42B6);	// @ (0x856 * 8 + 6)
#define                                 P3INPOL_bit         _BIT_ACCESS(PSMC3POL,6)
// PSMC3STR1<P3LSMEN>
extern volatile __bit                   P3LSMEN             __at(0x4379);	// @ (0x86F * 8 + 1)
#define                                 P3LSMEN_bit         _BIT_ACCESS(PSMC3STR1,1)
// PSMC3MDL<P3MDLBIT>
extern volatile __bit                   P3MDLBIT            __at(0x4295);	// @ (0x852 * 8 + 5)
#define                                 P3MDLBIT_bit        _BIT_ACCESS(PSMC3MDL,5)
// PSMC3MDL<P3MDLEN>
extern volatile __bit                   P3MDLEN             __at(0x4297);	// @ (0x852 * 8 + 7)
#define                                 P3MDLEN_bit         _BIT_ACCESS(PSMC3MDL,7)
// PSMC3MDL<P3MDLPOL>
extern volatile __bit                   P3MDLPOL            __at(0x4296);	// @ (0x852 * 8 + 6)
#define                                 P3MDLPOL_bit        _BIT_ACCESS(PSMC3MDL,6)
// PSMC3CON<P3MODE0>
extern volatile __bit                   P3MODE0             __at(0x4288);	// @ (0x851 * 8 + 0)
#define                                 P3MODE0_bit         _BIT_ACCESS(PSMC3CON,0)
// PSMC3CON<P3MODE1>
extern volatile __bit                   P3MODE1             __at(0x4289);	// @ (0x851 * 8 + 1)
#define                                 P3MODE1_bit         _BIT_ACCESS(PSMC3CON,1)
// PSMC3CON<P3MODE2>
extern volatile __bit                   P3MODE2             __at(0x428A);	// @ (0x851 * 8 + 2)
#define                                 P3MODE2_bit         _BIT_ACCESS(PSMC3CON,2)
// PSMC3CON<P3MODE3>
extern volatile __bit                   P3MODE3             __at(0x428B);	// @ (0x851 * 8 + 3)
#define                                 P3MODE3_bit         _BIT_ACCESS(PSMC3CON,3)
// PSMC3MDL<P3MSRC0>
extern volatile __bit                   P3MSRC0             __at(0x4290);	// @ (0x852 * 8 + 0)
#define                                 P3MSRC0_bit         _BIT_ACCESS(PSMC3MDL,0)
// PSMC3MDL<P3MSRC1>
extern volatile __bit                   P3MSRC1             __at(0x4291);	// @ (0x852 * 8 + 1)
#define                                 P3MSRC1_bit         _BIT_ACCESS(PSMC3MDL,1)
// PSMC3MDL<P3MSRC2>
extern volatile __bit                   P3MSRC2             __at(0x4292);	// @ (0x852 * 8 + 2)
#define                                 P3MSRC2_bit         _BIT_ACCESS(PSMC3MDL,2)
// PSMC3MDL<P3MSRC3>
extern volatile __bit                   P3MSRC3             __at(0x4293);	// @ (0x852 * 8 + 3)
#define                                 P3MSRC3_bit         _BIT_ACCESS(PSMC3MDL,3)
// PSMC3OEN<P3OEA>
extern volatile __bit                   P3OEA               __at(0x42A8);	// @ (0x855 * 8 + 0)
#define                                 P3OEA_bit           _BIT_ACCESS(PSMC3OEN,0)
// PSMC3OEN<P3OEB>
extern volatile __bit                   P3OEB               __at(0x42A9);	// @ (0x855 * 8 + 1)
#define                                 P3OEB_bit           _BIT_ACCESS(PSMC3OEN,1)
// PSMC3PHS<P3PHSC1>
extern volatile __bit                   P3PHSC1             __at(0x42D1);	// @ (0x85A * 8 + 1)
#define                                 P3PHSC1_bit         _BIT_ACCESS(PSMC3PHS,1)
// PSMC3PHS<P3PHSC2>
extern volatile __bit                   P3PHSC2             __at(0x42D2);	// @ (0x85A * 8 + 2)
#define                                 P3PHSC2_bit         _BIT_ACCESS(PSMC3PHS,2)
// PSMC3PHS<P3PHSC3>
extern volatile __bit                   P3PHSC3             __at(0x42D3);	// @ (0x85A * 8 + 3)
#define                                 P3PHSC3_bit         _BIT_ACCESS(PSMC3PHS,3)
// PSMC3PHS<P3PHSC4>
extern volatile __bit                   P3PHSC4             __at(0x42D4);	// @ (0x85A * 8 + 4)
#define                                 P3PHSC4_bit         _BIT_ACCESS(PSMC3PHS,4)
// PSMC3PHS<P3PHSIN>
extern volatile __bit                   P3PHSIN             __at(0x42D7);	// @ (0x85A * 8 + 7)
#define                                 P3PHSIN_bit         _BIT_ACCESS(PSMC3PHS,7)
// PSMC3PHS<P3PHST>
extern volatile __bit                   P3PHST              __at(0x42D0);	// @ (0x85A * 8 + 0)
#define                                 P3PHST_bit          _BIT_ACCESS(PSMC3PHS,0)
// PSMC3SYNC<P3POFST>
extern volatile __bit                   P3POFST             __at(0x429F);	// @ (0x853 * 8 + 7)
#define                                 P3POFST_bit         _BIT_ACCESS(PSMC3SYNC,7)
// PSMC3POL<P3POLA>
extern volatile __bit                   P3POLA              __at(0x42B0);	// @ (0x856 * 8 + 0)
#define                                 P3POLA_bit          _BIT_ACCESS(PSMC3POL,0)
// PSMC3POL<P3POLB>
extern volatile __bit                   P3POLB              __at(0x42B1);	// @ (0x856 * 8 + 1)
#define                                 P3POLB_bit          _BIT_ACCESS(PSMC3POL,1)
// PSMC3SYNC<P3PRPOL>
extern volatile __bit                   P3PRPOL             __at(0x429E);	// @ (0x853 * 8 + 6)
#define                                 P3PRPOL_bit         _BIT_ACCESS(PSMC3SYNC,6)
// PSMC3PRS<P3PRSC1>
extern volatile __bit                   P3PRSC1             __at(0x42E1);	// @ (0x85C * 8 + 1)
#define                                 P3PRSC1_bit         _BIT_ACCESS(PSMC3PRS,1)
// PSMC3PRS<P3PRSC2>
extern volatile __bit                   P3PRSC2             __at(0x42E2);	// @ (0x85C * 8 + 2)
#define                                 P3PRSC2_bit         _BIT_ACCESS(PSMC3PRS,2)
// PSMC3PRS<P3PRSC3>
extern volatile __bit                   P3PRSC3             __at(0x42E3);	// @ (0x85C * 8 + 3)
#define                                 P3PRSC3_bit         _BIT_ACCESS(PSMC3PRS,3)
// PSMC3PRS<P3PRSC4>
extern volatile __bit                   P3PRSC4             __at(0x42E4);	// @ (0x85C * 8 + 4)
#define                                 P3PRSC4_bit         _BIT_ACCESS(PSMC3PRS,4)
// PSMC3PRS<P3PRSIN>
extern volatile __bit                   P3PRSIN             __at(0x42E7);	// @ (0x85C * 8 + 7)
#define                                 P3PRSIN_bit         _BIT_ACCESS(PSMC3PRS,7)
// PSMC3PRS<P3PRST>
extern volatile __bit                   P3PRST              __at(0x42E0);	// @ (0x85C * 8 + 0)
#define                                 P3PRST_bit          _BIT_ACCESS(PSMC3PRS,0)
// PSMC3BLNK<P3REBM0>
extern volatile __bit                   P3REBM0             __at(0x42B8);	// @ (0x857 * 8 + 0)
#define                                 P3REBM0_bit         _BIT_ACCESS(PSMC3BLNK,0)
// PSMC3BLNK<P3REBM1>
extern volatile __bit                   P3REBM1             __at(0x42B9);	// @ (0x857 * 8 + 1)
#define                                 P3REBM1_bit         _BIT_ACCESS(PSMC3BLNK,1)
// PSMC3REBS<P3REBSC1>
extern volatile __bit                   P3REBSC1            __at(0x42C1);	// @ (0x858 * 8 + 1)
#define                                 P3REBSC1_bit        _BIT_ACCESS(PSMC3REBS,1)
// PSMC3REBS<P3REBSC2>
extern volatile __bit                   P3REBSC2            __at(0x42C2);	// @ (0x858 * 8 + 2)
#define                                 P3REBSC2_bit        _BIT_ACCESS(PSMC3REBS,2)
// PSMC3REBS<P3REBSC3>
extern volatile __bit                   P3REBSC3            __at(0x42C3);	// @ (0x858 * 8 + 3)
#define                                 P3REBSC3_bit        _BIT_ACCESS(PSMC3REBS,3)
// PSMC3REBS<P3REBSC4>
extern volatile __bit                   P3REBSC4            __at(0x42C4);	// @ (0x858 * 8 + 4)
#define                                 P3REBSC4_bit        _BIT_ACCESS(PSMC3REBS,4)
// PSMC3REBS<P3REBSIN>
extern volatile __bit                   P3REBSIN            __at(0x42C7);	// @ (0x858 * 8 + 7)
#define                                 P3REBSIN_bit        _BIT_ACCESS(PSMC3REBS,7)
// PSMC3STR1<P3SSYNC>
extern volatile __bit                   P3SSYNC             __at(0x437F);	// @ (0x86F * 8 + 7)
#define                                 P3SSYNC_bit         _BIT_ACCESS(PSMC3STR1,7)
// PSMC3STR0<P3STRA>
extern volatile __bit                   P3STRA              __at(0x4370);	// @ (0x86E * 8 + 0)
#define                                 P3STRA_bit          _BIT_ACCESS(PSMC3STR0,0)
// PSMC3STR0<P3STRB>
extern volatile __bit                   P3STRB              __at(0x4371);	// @ (0x86E * 8 + 1)
#define                                 P3STRB_bit          _BIT_ACCESS(PSMC3STR0,1)
// PSMC3SYNC<P3SYNC0>
extern volatile __bit                   P3SYNC0             __at(0x4298);	// @ (0x853 * 8 + 0)
#define                                 P3SYNC0_bit         _BIT_ACCESS(PSMC3SYNC,0)
// PSMC3SYNC<P3SYNC1>
extern volatile __bit                   P3SYNC1             __at(0x4299);	// @ (0x853 * 8 + 1)
#define                                 P3SYNC1_bit         _BIT_ACCESS(PSMC3SYNC,1)
// PSMC3SYNC<P3SYNC2>
extern volatile __bit                   P3SYNC2             __at(0x429A);	// @ (0x853 * 8 + 2)
#define                                 P3SYNC2_bit         _BIT_ACCESS(PSMC3SYNC,2)
// PSMC3INT<P3TDCIE>
extern volatile __bit                   P3TDCIE             __at(0x4305);	// @ (0x860 * 8 + 5)
#define                                 P3TDCIE_bit         _BIT_ACCESS(PSMC3INT,5)
// PSMC3INT<P3TDCIF>
extern volatile __bit                   P3TDCIF             __at(0x4301);	// @ (0x860 * 8 + 1)
#define                                 P3TDCIF_bit         _BIT_ACCESS(PSMC3INT,1)
// PSMC3INT<P3TOVIE>
extern volatile __bit                   P3TOVIE             __at(0x4307);	// @ (0x860 * 8 + 7)
#define                                 P3TOVIE_bit         _BIT_ACCESS(PSMC3INT,7)
// PSMC3INT<P3TOVIF>
extern volatile __bit                   P3TOVIF             __at(0x4303);	// @ (0x860 * 8 + 3)
#define                                 P3TOVIF_bit         _BIT_ACCESS(PSMC3INT,3)
// PSMC3INT<P3TPHIE>
extern volatile __bit                   P3TPHIE             __at(0x4306);	// @ (0x860 * 8 + 6)
#define                                 P3TPHIE_bit         _BIT_ACCESS(PSMC3INT,6)
// PSMC3INT<P3TPHIF>
extern volatile __bit                   P3TPHIF             __at(0x4302);	// @ (0x860 * 8 + 2)
#define                                 P3TPHIF_bit         _BIT_ACCESS(PSMC3INT,2)
// PSMC3INT<P3TPRIE>
extern volatile __bit                   P3TPRIE             __at(0x4304);	// @ (0x860 * 8 + 4)
#define                                 P3TPRIE_bit         _BIT_ACCESS(PSMC3INT,4)
// PSMC3INT<P3TPRIF>
extern volatile __bit                   P3TPRIF             __at(0x4300);	// @ (0x860 * 8 + 0)
#define                                 P3TPRIF_bit         _BIT_ACCESS(PSMC3INT,0)
// SSP1CON3<PCIE>
extern volatile __bit                   PCIE                __at(0x10BE);	// @ (0x217 * 8 + 6)
#define                                 PCIE_bit            _BIT_ACCESS(SSP1CON3,6)
// INTCON<PEIE>
extern volatile __bit                   PEIE                __at(0x5E);	// @ (0xB * 8 + 6)
#define                                 PEIE_bit            _BIT_ACCESS(INTCON,6)
// SSP1CON2<PEN>
extern volatile __bit                   PEN                 __at(0x10B2);	// @ (0x216 * 8 + 2)
#define                                 PEN_bit             _BIT_ACCESS(SSP1CON2,2)
// OSCSTAT<PLLR>
extern volatile __bit                   PLLR                __at(0x4D6);	// @ (0x9A * 8 + 6)
#define                                 PLLR_bit            _BIT_ACCESS(OSCSTAT,6)
// PIE4<PMSC3TIE>
extern volatile __bit                   PMSC3TIE            __at(0x4A6);	// @ (0x94 * 8 + 6)
#define                                 PMSC3TIE_bit        _BIT_ACCESS(PIE4,6)
// OPTION_REG<PS0>
extern volatile __bit                   _PS0                 __at(0x4A8);	// @ (0x95 * 8 + 0)  // Note: Changed by MikroE
#define                                 PS0_bit             _BIT_ACCESS(OPTION_REG,0)
// OPTION_REG<PS1>
extern volatile __bit                   _PS1                 __at(0x4A9);	// @ (0x95 * 8 + 1)  // Note: Changed by MikroE
#define                                 PS1_bit             _BIT_ACCESS(OPTION_REG,1)
// OPTION_REG<PS2>
extern volatile __bit                   _PS2                 __at(0x4AA);	// @ (0x95 * 8 + 2)  // Note: Changed by MikroE
#define                                 PS2_bit             _BIT_ACCESS(OPTION_REG,2)
// OPTION_REG<PSA>
extern volatile __bit                   PSA                 __at(0x4AB);	// @ (0x95 * 8 + 3)
#define                                 PSA_bit             _BIT_ACCESS(OPTION_REG,3)
// PSMC1BLKF<PSMC1BLKF0>
extern volatile __bit                   PSMC1BLKF0          __at(0x4160);	// @ (0x82C * 8 + 0)
#define                                 PSMC1BLKF0_bit      _BIT_ACCESS(PSMC1BLKF,0)
// PSMC1BLKF<PSMC1BLKF1>
extern volatile __bit                   PSMC1BLKF1          __at(0x4161);	// @ (0x82C * 8 + 1)
#define                                 PSMC1BLKF1_bit      _BIT_ACCESS(PSMC1BLKF,1)
// PSMC1BLKF<PSMC1BLKF2>
extern volatile __bit                   PSMC1BLKF2          __at(0x4162);	// @ (0x82C * 8 + 2)
#define                                 PSMC1BLKF2_bit      _BIT_ACCESS(PSMC1BLKF,2)
// PSMC1BLKF<PSMC1BLKF3>
extern volatile __bit                   PSMC1BLKF3          __at(0x4163);	// @ (0x82C * 8 + 3)
#define                                 PSMC1BLKF3_bit      _BIT_ACCESS(PSMC1BLKF,3)
// PSMC1BLKF<PSMC1BLKF4>
extern volatile __bit                   PSMC1BLKF4          __at(0x4164);	// @ (0x82C * 8 + 4)
#define                                 PSMC1BLKF4_bit      _BIT_ACCESS(PSMC1BLKF,4)
// PSMC1BLKF<PSMC1BLKF5>
extern volatile __bit                   PSMC1BLKF5          __at(0x4165);	// @ (0x82C * 8 + 5)
#define                                 PSMC1BLKF5_bit      _BIT_ACCESS(PSMC1BLKF,5)
// PSMC1BLKF<PSMC1BLKF6>
extern volatile __bit                   PSMC1BLKF6          __at(0x4166);	// @ (0x82C * 8 + 6)
#define                                 PSMC1BLKF6_bit      _BIT_ACCESS(PSMC1BLKF,6)
// PSMC1BLKF<PSMC1BLKF7>
extern volatile __bit                   PSMC1BLKF7          __at(0x4167);	// @ (0x82C * 8 + 7)
#define                                 PSMC1BLKF7_bit      _BIT_ACCESS(PSMC1BLKF,7)
// PSMC1BLKR<PSMC1BLKR0>
extern volatile __bit                   PSMC1BLKR0          __at(0x4158);	// @ (0x82B * 8 + 0)
#define                                 PSMC1BLKR0_bit      _BIT_ACCESS(PSMC1BLKR,0)
// PSMC1BLKR<PSMC1BLKR1>
extern volatile __bit                   PSMC1BLKR1          __at(0x4159);	// @ (0x82B * 8 + 1)
#define                                 PSMC1BLKR1_bit      _BIT_ACCESS(PSMC1BLKR,1)
// PSMC1BLKR<PSMC1BLKR2>
extern volatile __bit                   PSMC1BLKR2          __at(0x415A);	// @ (0x82B * 8 + 2)
#define                                 PSMC1BLKR2_bit      _BIT_ACCESS(PSMC1BLKR,2)
// PSMC1BLKR<PSMC1BLKR3>
extern volatile __bit                   PSMC1BLKR3          __at(0x415B);	// @ (0x82B * 8 + 3)
#define                                 PSMC1BLKR3_bit      _BIT_ACCESS(PSMC1BLKR,3)
// PSMC1BLKR<PSMC1BLKR4>
extern volatile __bit                   PSMC1BLKR4          __at(0x415C);	// @ (0x82B * 8 + 4)
#define                                 PSMC1BLKR4_bit      _BIT_ACCESS(PSMC1BLKR,4)
// PSMC1BLKR<PSMC1BLKR5>
extern volatile __bit                   PSMC1BLKR5          __at(0x415D);	// @ (0x82B * 8 + 5)
#define                                 PSMC1BLKR5_bit      _BIT_ACCESS(PSMC1BLKR,5)
// PSMC1BLKR<PSMC1BLKR6>
extern volatile __bit                   PSMC1BLKR6          __at(0x415E);	// @ (0x82B * 8 + 6)
#define                                 PSMC1BLKR6_bit      _BIT_ACCESS(PSMC1BLKR,6)
// PSMC1BLKR<PSMC1BLKR7>
extern volatile __bit                   PSMC1BLKR7          __at(0x415F);	// @ (0x82B * 8 + 7)
#define                                 PSMC1BLKR7_bit      _BIT_ACCESS(PSMC1BLKR,7)
// PSMC1DBF<PSMC1DBF0>
extern volatile __bit                   PSMC1DBF0           __at(0x4150);	// @ (0x82A * 8 + 0)
#define                                 PSMC1DBF0_bit       _BIT_ACCESS(PSMC1DBF,0)
// PSMC1DBF<PSMC1DBF1>
extern volatile __bit                   PSMC1DBF1           __at(0x4151);	// @ (0x82A * 8 + 1)
#define                                 PSMC1DBF1_bit       _BIT_ACCESS(PSMC1DBF,1)
// PSMC1DBF<PSMC1DBF2>
extern volatile __bit                   PSMC1DBF2           __at(0x4152);	// @ (0x82A * 8 + 2)
#define                                 PSMC1DBF2_bit       _BIT_ACCESS(PSMC1DBF,2)
// PSMC1DBF<PSMC1DBF3>
extern volatile __bit                   PSMC1DBF3           __at(0x4153);	// @ (0x82A * 8 + 3)
#define                                 PSMC1DBF3_bit       _BIT_ACCESS(PSMC1DBF,3)
// PSMC1DBF<PSMC1DBF4>
extern volatile __bit                   PSMC1DBF4           __at(0x4154);	// @ (0x82A * 8 + 4)
#define                                 PSMC1DBF4_bit       _BIT_ACCESS(PSMC1DBF,4)
// PSMC1DBF<PSMC1DBF5>
extern volatile __bit                   PSMC1DBF5           __at(0x4155);	// @ (0x82A * 8 + 5)
#define                                 PSMC1DBF5_bit       _BIT_ACCESS(PSMC1DBF,5)
// PSMC1DBF<PSMC1DBF6>
extern volatile __bit                   PSMC1DBF6           __at(0x4156);	// @ (0x82A * 8 + 6)
#define                                 PSMC1DBF6_bit       _BIT_ACCESS(PSMC1DBF,6)
// PSMC1DBF<PSMC1DBF7>
extern volatile __bit                   PSMC1DBF7           __at(0x4157);	// @ (0x82A * 8 + 7)
#define                                 PSMC1DBF7_bit       _BIT_ACCESS(PSMC1DBF,7)
// PSMC1DBR<PSMC1DBR0>
extern volatile __bit                   PSMC1DBR0           __at(0x4148);	// @ (0x829 * 8 + 0)
#define                                 PSMC1DBR0_bit       _BIT_ACCESS(PSMC1DBR,0)
// PSMC1DBR<PSMC1DBR1>
extern volatile __bit                   PSMC1DBR1           __at(0x4149);	// @ (0x829 * 8 + 1)
#define                                 PSMC1DBR1_bit       _BIT_ACCESS(PSMC1DBR,1)
// PSMC1DBR<PSMC1DBR2>
extern volatile __bit                   PSMC1DBR2           __at(0x414A);	// @ (0x829 * 8 + 2)
#define                                 PSMC1DBR2_bit       _BIT_ACCESS(PSMC1DBR,2)
// PSMC1DBR<PSMC1DBR3>
extern volatile __bit                   PSMC1DBR3           __at(0x414B);	// @ (0x829 * 8 + 3)
#define                                 PSMC1DBR3_bit       _BIT_ACCESS(PSMC1DBR,3)
// PSMC1DBR<PSMC1DBR4>
extern volatile __bit                   PSMC1DBR4           __at(0x414C);	// @ (0x829 * 8 + 4)
#define                                 PSMC1DBR4_bit       _BIT_ACCESS(PSMC1DBR,4)
// PSMC1DBR<PSMC1DBR5>
extern volatile __bit                   PSMC1DBR5           __at(0x414D);	// @ (0x829 * 8 + 5)
#define                                 PSMC1DBR5_bit       _BIT_ACCESS(PSMC1DBR,5)
// PSMC1DBR<PSMC1DBR6>
