MikroElektronika/core_packages/PIC/XC8/def/PIC16LF1786/mcu.h
extern volatile __bit                   PSMC3PH1            __at(0x4309);	// @ (0x861 * 8 + 1)
#define                                 PSMC3PH1_bit        _BIT_ACCESS(PSMC3PHL,1)
// PSMC3PHH<PSMC3PH10>
extern volatile __bit                   PSMC3PH10           __at(0x4312);	// @ (0x862 * 8 + 2)
#define                                 PSMC3PH10_bit       _BIT_ACCESS(PSMC3PHH,2)
// PSMC3PHH<PSMC3PH11>
extern volatile __bit                   PSMC3PH11           __at(0x4313);	// @ (0x862 * 8 + 3)
#define                                 PSMC3PH11_bit       _BIT_ACCESS(PSMC3PHH,3)
// PSMC3PHH<PSMC3PH12>
extern volatile __bit                   PSMC3PH12           __at(0x4314);	// @ (0x862 * 8 + 4)
#define                                 PSMC3PH12_bit       _BIT_ACCESS(PSMC3PHH,4)
// PSMC3PHH<PSMC3PH13>
extern volatile __bit                   PSMC3PH13           __at(0x4315);	// @ (0x862 * 8 + 5)
#define                                 PSMC3PH13_bit       _BIT_ACCESS(PSMC3PHH,5)
// PSMC3PHH<PSMC3PH14>
extern volatile __bit                   PSMC3PH14           __at(0x4316);	// @ (0x862 * 8 + 6)
#define                                 PSMC3PH14_bit       _BIT_ACCESS(PSMC3PHH,6)
// PSMC3PHH<PSMC3PH15>
extern volatile __bit                   PSMC3PH15           __at(0x4317);	// @ (0x862 * 8 + 7)
#define                                 PSMC3PH15_bit       _BIT_ACCESS(PSMC3PHH,7)
// PSMC3PHL<PSMC3PH2>
extern volatile __bit                   PSMC3PH2            __at(0x430A);	// @ (0x861 * 8 + 2)
#define                                 PSMC3PH2_bit        _BIT_ACCESS(PSMC3PHL,2)
// PSMC3PHL<PSMC3PH3>
extern volatile __bit                   PSMC3PH3            __at(0x430B);	// @ (0x861 * 8 + 3)
#define                                 PSMC3PH3_bit        _BIT_ACCESS(PSMC3PHL,3)
// PSMC3PHL<PSMC3PH4>
extern volatile __bit                   PSMC3PH4            __at(0x430C);	// @ (0x861 * 8 + 4)
#define                                 PSMC3PH4_bit        _BIT_ACCESS(PSMC3PHL,4)
// PSMC3PHL<PSMC3PH5>
extern volatile __bit                   PSMC3PH5            __at(0x430D);	// @ (0x861 * 8 + 5)
#define                                 PSMC3PH5_bit        _BIT_ACCESS(PSMC3PHL,5)
// PSMC3PHL<PSMC3PH6>
extern volatile __bit                   PSMC3PH6            __at(0x430E);	// @ (0x861 * 8 + 6)
#define                                 PSMC3PH6_bit        _BIT_ACCESS(PSMC3PHL,6)
// PSMC3PHL<PSMC3PH7>
extern volatile __bit                   PSMC3PH7            __at(0x430F);	// @ (0x861 * 8 + 7)
#define                                 PSMC3PH7_bit        _BIT_ACCESS(PSMC3PHL,7)
// PSMC3PHH<PSMC3PH8>
extern volatile __bit                   PSMC3PH8            __at(0x4310);	// @ (0x862 * 8 + 0)
#define                                 PSMC3PH8_bit        _BIT_ACCESS(PSMC3PHH,0)
// PSMC3PHH<PSMC3PH9>
extern volatile __bit                   PSMC3PH9            __at(0x4311);	// @ (0x862 * 8 + 1)
#define                                 PSMC3PH9_bit        _BIT_ACCESS(PSMC3PHH,1)
// PSMC3PRL<PSMC3PR0>
extern volatile __bit                   PSMC3PR0            __at(0x4328);	// @ (0x865 * 8 + 0)
#define                                 PSMC3PR0_bit        _BIT_ACCESS(PSMC3PRL,0)
// PSMC3PRL<PSMC3PR1>
extern volatile __bit                   PSMC3PR1            __at(0x4329);	// @ (0x865 * 8 + 1)
#define                                 PSMC3PR1_bit        _BIT_ACCESS(PSMC3PRL,1)
// PSMC3PRH<PSMC3PR10>
extern volatile __bit                   PSMC3PR10           __at(0x4332);	// @ (0x866 * 8 + 2)
#define                                 PSMC3PR10_bit       _BIT_ACCESS(PSMC3PRH,2)
// PSMC3PRH<PSMC3PR11>
extern volatile __bit                   PSMC3PR11           __at(0x4333);	// @ (0x866 * 8 + 3)
#define                                 PSMC3PR11_bit       _BIT_ACCESS(PSMC3PRH,3)
// PSMC3PRH<PSMC3PR12>
extern volatile __bit                   PSMC3PR12           __at(0x4334);	// @ (0x866 * 8 + 4)
#define                                 PSMC3PR12_bit       _BIT_ACCESS(PSMC3PRH,4)
// PSMC3PRH<PSMC3PR13>
extern volatile __bit                   PSMC3PR13           __at(0x4335);	// @ (0x866 * 8 + 5)
#define                                 PSMC3PR13_bit       _BIT_ACCESS(PSMC3PRH,5)
// PSMC3PRH<PSMC3PR14>
extern volatile __bit                   PSMC3PR14           __at(0x4336);	// @ (0x866 * 8 + 6)
#define                                 PSMC3PR14_bit       _BIT_ACCESS(PSMC3PRH,6)
// PSMC3PRH<PSMC3PR15>
extern volatile __bit                   PSMC3PR15           __at(0x4337);	// @ (0x866 * 8 + 7)
#define                                 PSMC3PR15_bit       _BIT_ACCESS(PSMC3PRH,7)
// PSMC3PRL<PSMC3PR2>
extern volatile __bit                   PSMC3PR2            __at(0x432A);	// @ (0x865 * 8 + 2)
#define                                 PSMC3PR2_bit        _BIT_ACCESS(PSMC3PRL,2)
// PSMC3PRL<PSMC3PR3>
extern volatile __bit                   PSMC3PR3            __at(0x432B);	// @ (0x865 * 8 + 3)
#define                                 PSMC3PR3_bit        _BIT_ACCESS(PSMC3PRL,3)
// PSMC3PRL<PSMC3PR4>
extern volatile __bit                   PSMC3PR4            __at(0x432C);	// @ (0x865 * 8 + 4)
#define                                 PSMC3PR4_bit        _BIT_ACCESS(PSMC3PRL,4)
// PSMC3PRL<PSMC3PR5>
extern volatile __bit                   PSMC3PR5            __at(0x432D);	// @ (0x865 * 8 + 5)
#define                                 PSMC3PR5_bit        _BIT_ACCESS(PSMC3PRL,5)
// PSMC3PRL<PSMC3PR6>
extern volatile __bit                   PSMC3PR6            __at(0x432E);	// @ (0x865 * 8 + 6)
#define                                 PSMC3PR6_bit        _BIT_ACCESS(PSMC3PRL,6)
// PSMC3PRL<PSMC3PR7>
extern volatile __bit                   PSMC3PR7            __at(0x432F);	// @ (0x865 * 8 + 7)
#define                                 PSMC3PR7_bit        _BIT_ACCESS(PSMC3PRL,7)
// PSMC3PRH<PSMC3PR8>
extern volatile __bit                   PSMC3PR8            __at(0x4330);	// @ (0x866 * 8 + 0)
#define                                 PSMC3PR8_bit        _BIT_ACCESS(PSMC3PRH,0)
// PSMC3PRH<PSMC3PR9>
extern volatile __bit                   PSMC3PR9            __at(0x4331);	// @ (0x866 * 8 + 1)
#define                                 PSMC3PR9_bit        _BIT_ACCESS(PSMC3PRH,1)
// PIE4<PSMC3SIE>
extern volatile __bit                   PSMC3SIE            __at(0x4A2);	// @ (0x94 * 8 + 2)
#define                                 PSMC3SIE_bit        _BIT_ACCESS(PIE4,2)
// PIR4<PSMC3SIF>
extern volatile __bit                   PSMC3SIF            __at(0xA2);	// @ (0x14 * 8 + 2)
#define                                 PSMC3SIF_bit        _BIT_ACCESS(PIR4,2)
// PIE4<PSMC3TIE>
extern volatile __bit                   PSMC3TIE            __at(0x4A6);	// @ (0x94 * 8 + 6)
#define                                 PSMC3TIE_bit        _BIT_ACCESS(PIE4,6)
// PIR4<PSMC3TIF>
extern volatile __bit                   PSMC3TIF            __at(0xA6);	// @ (0x14 * 8 + 6)
#define                                 PSMC3TIF_bit        _BIT_ACCESS(PIR4,6)
// PSMC3TMRL<PSMC3TMR0>
extern volatile __bit                   PSMC3TMR0           __at(0x4338);	// @ (0x867 * 8 + 0)
#define                                 PSMC3TMR0_bit       _BIT_ACCESS(PSMC3TMRL,0)
// PSMC3TMRL<PSMC3TMR1>
extern volatile __bit                   PSMC3TMR1           __at(0x4339);	// @ (0x867 * 8 + 1)
#define                                 PSMC3TMR1_bit       _BIT_ACCESS(PSMC3TMRL,1)
// PSMC3TMRH<PSMC3TMR10>
extern volatile __bit                   PSMC3TMR10          __at(0x4342);	// @ (0x868 * 8 + 2)
#define                                 PSMC3TMR10_bit      _BIT_ACCESS(PSMC3TMRH,2)
// PSMC3TMRH<PSMC3TMR11>
extern volatile __bit                   PSMC3TMR11          __at(0x4343);	// @ (0x868 * 8 + 3)
#define                                 PSMC3TMR11_bit      _BIT_ACCESS(PSMC3TMRH,3)
// PSMC3TMRH<PSMC3TMR12>
extern volatile __bit                   PSMC3TMR12          __at(0x4344);	// @ (0x868 * 8 + 4)
#define                                 PSMC3TMR12_bit      _BIT_ACCESS(PSMC3TMRH,4)
// PSMC3TMRH<PSMC3TMR13>
extern volatile __bit                   PSMC3TMR13          __at(0x4345);	// @ (0x868 * 8 + 5)
#define                                 PSMC3TMR13_bit      _BIT_ACCESS(PSMC3TMRH,5)
// PSMC3TMRH<PSMC3TMR14>
extern volatile __bit                   PSMC3TMR14          __at(0x4346);	// @ (0x868 * 8 + 6)
#define                                 PSMC3TMR14_bit      _BIT_ACCESS(PSMC3TMRH,6)
// PSMC3TMRH<PSMC3TMR15>
extern volatile __bit                   PSMC3TMR15          __at(0x4347);	// @ (0x868 * 8 + 7)
#define                                 PSMC3TMR15_bit      _BIT_ACCESS(PSMC3TMRH,7)
// PSMC3TMRL<PSMC3TMR2>
extern volatile __bit                   PSMC3TMR2           __at(0x433A);	// @ (0x867 * 8 + 2)
#define                                 PSMC3TMR2_bit       _BIT_ACCESS(PSMC3TMRL,2)
// PSMC3TMRL<PSMC3TMR3>
extern volatile __bit                   PSMC3TMR3           __at(0x433B);	// @ (0x867 * 8 + 3)
#define                                 PSMC3TMR3_bit       _BIT_ACCESS(PSMC3TMRL,3)
// PSMC3TMRL<PSMC3TMR4>
extern volatile __bit                   PSMC3TMR4           __at(0x433C);	// @ (0x867 * 8 + 4)
#define                                 PSMC3TMR4_bit       _BIT_ACCESS(PSMC3TMRL,4)
// PSMC3TMRL<PSMC3TMR5>
extern volatile __bit                   PSMC3TMR5           __at(0x433D);	// @ (0x867 * 8 + 5)
#define                                 PSMC3TMR5_bit       _BIT_ACCESS(PSMC3TMRL,5)
// PSMC3TMRL<PSMC3TMR6>
extern volatile __bit                   PSMC3TMR6           __at(0x433E);	// @ (0x867 * 8 + 6)
#define                                 PSMC3TMR6_bit       _BIT_ACCESS(PSMC3TMRL,6)
// PSMC3TMRL<PSMC3TMR7>
extern volatile __bit                   PSMC3TMR7           __at(0x433F);	// @ (0x867 * 8 + 7)
#define                                 PSMC3TMR7_bit       _BIT_ACCESS(PSMC3TMRL,7)
// PSMC3TMRH<PSMC3TMR8>
extern volatile __bit                   PSMC3TMR8           __at(0x4340);	// @ (0x868 * 8 + 0)
#define                                 PSMC3TMR8_bit       _BIT_ACCESS(PSMC3TMRH,0)
// PSMC3TMRH<PSMC3TMR9>
extern volatile __bit                   PSMC3TMR9           __at(0x4341);	// @ (0x868 * 8 + 1)
#define                                 PSMC3TMR9_bit       _BIT_ACCESS(PSMC3TMRH,1)
// PORTA<RA0>
extern volatile __bit                   RA0                 __at(0x60);	// @ (0xC * 8 + 0)
#define                                 RA0_bit             _BIT_ACCESS(PORTA,0)
// PORTA<RA1>
extern volatile __bit                   RA1                 __at(0x61);	// @ (0xC * 8 + 1)
#define                                 RA1_bit             _BIT_ACCESS(PORTA,1)
// PORTA<RA2>
extern volatile __bit                   RA2                 __at(0x62);	// @ (0xC * 8 + 2)
#define                                 RA2_bit             _BIT_ACCESS(PORTA,2)
// PORTA<RA3>
extern volatile __bit                   RA3                 __at(0x63);	// @ (0xC * 8 + 3)
#define                                 RA3_bit             _BIT_ACCESS(PORTA,3)
// PORTA<RA4>
extern volatile __bit                   RA4                 __at(0x64);	// @ (0xC * 8 + 4)
#define                                 RA4_bit             _BIT_ACCESS(PORTA,4)
// PORTA<RA5>
extern volatile __bit                   RA5                 __at(0x65);	// @ (0xC * 8 + 5)
#define                                 RA5_bit             _BIT_ACCESS(PORTA,5)
// PORTA<RA6>
extern volatile __bit                   RA6                 __at(0x66);	// @ (0xC * 8 + 6)
#define                                 RA6_bit             _BIT_ACCESS(PORTA,6)
// PORTA<RA7>
extern volatile __bit                   RA7                 __at(0x67);	// @ (0xC * 8 + 7)
#define                                 RA7_bit             _BIT_ACCESS(PORTA,7)
// PORTB<RB0>
extern volatile __bit                   RB0                 __at(0x68);	// @ (0xD * 8 + 0)
#define                                 RB0_bit             _BIT_ACCESS(PORTB,0)
// PORTB<RB1>
extern volatile __bit                   RB1                 __at(0x69);	// @ (0xD * 8 + 1)
#define                                 RB1_bit             _BIT_ACCESS(PORTB,1)
// PORTB<RB2>
extern volatile __bit                   RB2                 __at(0x6A);	// @ (0xD * 8 + 2)
#define                                 RB2_bit             _BIT_ACCESS(PORTB,2)
// PORTB<RB3>
extern volatile __bit                   RB3                 __at(0x6B);	// @ (0xD * 8 + 3)
#define                                 RB3_bit             _BIT_ACCESS(PORTB,3)
// PORTB<RB4>
extern volatile __bit                   RB4                 __at(0x6C);	// @ (0xD * 8 + 4)
#define                                 RB4_bit             _BIT_ACCESS(PORTB,4)
// PORTB<RB5>
extern volatile __bit                   RB5                 __at(0x6D);	// @ (0xD * 8 + 5)
#define                                 RB5_bit             _BIT_ACCESS(PORTB,5)
// PORTB<RB6>
extern volatile __bit                   RB6                 __at(0x6E);	// @ (0xD * 8 + 6)
#define                                 RB6_bit             _BIT_ACCESS(PORTB,6)
// PORTB<RB7>
extern volatile __bit                   RB7                 __at(0x6F);	// @ (0xD * 8 + 7)
#define                                 RB7_bit             _BIT_ACCESS(PORTB,7)
// PORTC<RC0>
extern volatile __bit                   RC0                 __at(0x70);	// @ (0xE * 8 + 0)
#define                                 RC0_bit             _BIT_ACCESS(PORTC,0)
// PORTC<RC1>
extern volatile __bit                   RC1                 __at(0x71);	// @ (0xE * 8 + 1)
#define                                 RC1_bit             _BIT_ACCESS(PORTC,1)
// PORTC<RC2>
extern volatile __bit                   RC2                 __at(0x72);	// @ (0xE * 8 + 2)
#define                                 RC2_bit             _BIT_ACCESS(PORTC,2)
// PORTC<RC3>
extern volatile __bit                   RC3                 __at(0x73);	// @ (0xE * 8 + 3)
#define                                 RC3_bit             _BIT_ACCESS(PORTC,3)
// PORTC<RC4>
extern volatile __bit                   RC4                 __at(0x74);	// @ (0xE * 8 + 4)
#define                                 RC4_bit             _BIT_ACCESS(PORTC,4)
// PORTC<RC5>
extern volatile __bit                   RC5                 __at(0x75);	// @ (0xE * 8 + 5)
#define                                 RC5_bit             _BIT_ACCESS(PORTC,5)
// PORTC<RC6>
extern volatile __bit                   RC6                 __at(0x76);	// @ (0xE * 8 + 6)
#define                                 RC6_bit             _BIT_ACCESS(PORTC,6)
// PORTC<RC7>
extern volatile __bit                   RC7                 __at(0x77);	// @ (0xE * 8 + 7)
#define                                 RC7_bit             _BIT_ACCESS(PORTC,7)
// SSP1CON2<RCEN>
extern volatile __bit                   RCEN                __at(0x10B3);	// @ (0x216 * 8 + 3)
#define                                 RCEN_bit            _BIT_ACCESS(SSP1CON2,3)
// BAUD1CON<RCIDL>
extern volatile __bit                   RCIDL               __at(0xCFE);	// @ (0x19F * 8 + 6)
#define                                 RCIDL_bit           _BIT_ACCESS(BAUD1CON,6)
// PIE1<RCIE>
extern volatile __bit                   RCIE                __at(0x48D);	// @ (0x91 * 8 + 5)
#define                                 RCIE_bit            _BIT_ACCESS(PIE1,5)
// PIR1<RCIF>
extern volatile __bit                   RCIF                __at(0x8D);	// @ (0x11 * 8 + 5)
#define                                 RCIF_bit            _BIT_ACCESS(PIR1,5)
// EECON1<RD>
extern volatile __bit                   RD                  __at(0xCA8);	// @ (0x195 * 8 + 0)
#define                                 RD_bit              _BIT_ACCESS(EECON1,0)
// PORTE<RE3>
extern volatile __bit                   RE3                 __at(0x83);	// @ (0x10 * 8 + 3)
#define                                 RE3_bit             _BIT_ACCESS(PORTE,3)
// SSP1CON2<RSEN>
extern volatile __bit                   RSEN                __at(0x10B1);	// @ (0x216 * 8 + 1)
#define                                 RSEN_bit            _BIT_ACCESS(SSP1CON2,1)
// RC1STA<RX9>
extern volatile __bit                   RX9                 __at(0xCEE);	// @ (0x19D * 8 + 6)
#define                                 RX9_bit             _BIT_ACCESS(RC1STA,6)
// RC1STA<RX9D>
extern volatile __bit                   RX9D                __at(0xCE8);	// @ (0x19D * 8 + 0)
#define                                 RX9D_bit            _BIT_ACCESS(RC1STA,0)
// APFCON1<RXSEL>
extern volatile __bit                   RXSEL               __at(0x8E9);	// @ (0x11D * 8 + 1)
#define                                 RXSEL_bit           _BIT_ACCESS(APFCON1,1)
// SSP1STAT<R_nW>
extern volatile __bit                   R_nW                __at(0x10A2);	// @ (0x214 * 8 + 2)
#define                                 R_nW_bit            _BIT_ACCESS(SSP1STAT,2)
// SSP1CON3<SBCDE>
extern volatile __bit                   SBCDE               __at(0x10BA);	// @ (0x217 * 8 + 2)
#define                                 SBCDE_bit           _BIT_ACCESS(SSP1CON3,2)
// BORCON<SBOREN>
extern volatile __bit                   SBOREN              __at(0x8B7);	// @ (0x116 * 8 + 7)
#define                                 SBOREN_bit          _BIT_ACCESS(BORCON,7)
// SSP1CON3<SCIE>
extern volatile __bit                   SCIE                __at(0x10BD);	// @ (0x217 * 8 + 5)
#define                                 SCIE_bit            _BIT_ACCESS(SSP1CON3,5)
// BAUD1CON<SCKP>
extern volatile __bit                   SCKP                __at(0xCFC);	// @ (0x19F * 8 + 4)
#define                                 SCKP_bit            _BIT_ACCESS(BAUD1CON,4)
// APFCON1<SCKSEL>
extern volatile __bit                   SCKSEL              __at(0x8EC);	// @ (0x11D * 8 + 4)
#define                                 SCKSEL_bit          _BIT_ACCESS(APFCON1,4)
// OSCCON<SCS0>
extern volatile __bit                   SCS0                __at(0x4C8);	// @ (0x99 * 8 + 0)
#define                                 SCS0_bit            _BIT_ACCESS(OSCCON,0)
// OSCCON<SCS1>
extern volatile __bit                   SCS1                __at(0x4C9);	// @ (0x99 * 8 + 1)
#define                                 SCS1_bit            _BIT_ACCESS(OSCCON,1)
// SSP1CON3<SDAHT>
extern volatile __bit                   SDAHT               __at(0x10BB);	// @ (0x217 * 8 + 3)
#define                                 SDAHT_bit           _BIT_ACCESS(SSP1CON3,3)
// APFCON1<SDISEL>
extern volatile __bit                   SDISEL              __at(0x8EB);	// @ (0x11D * 8 + 3)
#define                                 SDISEL_bit          _BIT_ACCESS(APFCON1,3)
// APFCON1<SDOSEL>
extern volatile __bit                   SDOSEL              __at(0x8ED);	// @ (0x11D * 8 + 5)
#define                                 SDOSEL_bit          _BIT_ACCESS(APFCON1,5)
// SSP1CON2<SEN>
extern volatile __bit                   SEN                 __at(0x10B0);	// @ (0x216 * 8 + 0)
#define                                 SEN_bit             _BIT_ACCESS(SSP1CON2,0)
// TX1STA<SENDB>
extern volatile __bit                   SENDB               __at(0xCF3);	// @ (0x19E * 8 + 3)
#define                                 SENDB_bit           _BIT_ACCESS(TX1STA,3)
// SLRCONA<SLRCONA0>
extern volatile __bit                   SLRCONA0            __at(0x1860);	// @ (0x30C * 8 + 0)
#define                                 SLRCONA0_bit        _BIT_ACCESS(SLRCONA,0)
// SLRCONA<SLRCONA1>
extern volatile __bit                   SLRCONA1            __at(0x1861);	// @ (0x30C * 8 + 1)
#define                                 SLRCONA1_bit        _BIT_ACCESS(SLRCONA,1)
// SLRCONA<SLRCONA2>
extern volatile __bit                   SLRCONA2            __at(0x1862);	// @ (0x30C * 8 + 2)
#define                                 SLRCONA2_bit        _BIT_ACCESS(SLRCONA,2)
// SLRCONA<SLRCONA3>
extern volatile __bit                   SLRCONA3            __at(0x1863);	// @ (0x30C * 8 + 3)
#define                                 SLRCONA3_bit        _BIT_ACCESS(SLRCONA,3)
// SLRCONA<SLRCONA4>
extern volatile __bit                   SLRCONA4            __at(0x1864);	// @ (0x30C * 8 + 4)
#define                                 SLRCONA4_bit        _BIT_ACCESS(SLRCONA,4)
// SLRCONA<SLRCONA5>
extern volatile __bit                   SLRCONA5            __at(0x1865);	// @ (0x30C * 8 + 5)
#define                                 SLRCONA5_bit        _BIT_ACCESS(SLRCONA,5)
// SLRCONA<SLRCONA6>
extern volatile __bit                   SLRCONA6            __at(0x1866);	// @ (0x30C * 8 + 6)
#define                                 SLRCONA6_bit        _BIT_ACCESS(SLRCONA,6)
// SLRCONA<SLRCONA7>
extern volatile __bit                   SLRCONA7            __at(0x1867);	// @ (0x30C * 8 + 7)
#define                                 SLRCONA7_bit        _BIT_ACCESS(SLRCONA,7)
// SLRCONB<SLRCONB0>
extern volatile __bit                   SLRCONB0            __at(0x1868);	// @ (0x30D * 8 + 0)
#define                                 SLRCONB0_bit        _BIT_ACCESS(SLRCONB,0)
// SLRCONB<SLRCONB1>
extern volatile __bit                   SLRCONB1            __at(0x1869);	// @ (0x30D * 8 + 1)
#define                                 SLRCONB1_bit        _BIT_ACCESS(SLRCONB,1)
// SLRCONB<SLRCONB2>
extern volatile __bit                   SLRCONB2            __at(0x186A);	// @ (0x30D * 8 + 2)
#define                                 SLRCONB2_bit        _BIT_ACCESS(SLRCONB,2)
// SLRCONB<SLRCONB3>
extern volatile __bit                   SLRCONB3            __at(0x186B);	// @ (0x30D * 8 + 3)
#define                                 SLRCONB3_bit        _BIT_ACCESS(SLRCONB,3)
// SLRCONB<SLRCONB4>
extern volatile __bit                   SLRCONB4            __at(0x186C);	// @ (0x30D * 8 + 4)
#define                                 SLRCONB4_bit        _BIT_ACCESS(SLRCONB,4)
// SLRCONB<SLRCONB5>
extern volatile __bit                   SLRCONB5            __at(0x186D);	// @ (0x30D * 8 + 5)
#define                                 SLRCONB5_bit        _BIT_ACCESS(SLRCONB,5)
// SLRCONB<SLRCONB6>
extern volatile __bit                   SLRCONB6            __at(0x186E);	// @ (0x30D * 8 + 6)
#define                                 SLRCONB6_bit        _BIT_ACCESS(SLRCONB,6)
// SLRCONB<SLRCONB7>
extern volatile __bit                   SLRCONB7            __at(0x186F);	// @ (0x30D * 8 + 7)
#define                                 SLRCONB7_bit        _BIT_ACCESS(SLRCONB,7)
// SLRCONC<SLRCONC0>
extern volatile __bit                   SLRCONC0            __at(0x1870);	// @ (0x30E * 8 + 0)
#define                                 SLRCONC0_bit        _BIT_ACCESS(SLRCONC,0)
// SLRCONC<SLRCONC1>
extern volatile __bit                   SLRCONC1            __at(0x1871);	// @ (0x30E * 8 + 1)
#define                                 SLRCONC1_bit        _BIT_ACCESS(SLRCONC,1)
// SLRCONC<SLRCONC2>
extern volatile __bit                   SLRCONC2            __at(0x1872);	// @ (0x30E * 8 + 2)
#define                                 SLRCONC2_bit        _BIT_ACCESS(SLRCONC,2)
// SLRCONC<SLRCONC3>
extern volatile __bit                   SLRCONC3            __at(0x1873);	// @ (0x30E * 8 + 3)
#define                                 SLRCONC3_bit        _BIT_ACCESS(SLRCONC,3)
// SLRCONC<SLRCONC4>
extern volatile __bit                   SLRCONC4            __at(0x1874);	// @ (0x30E * 8 + 4)
#define                                 SLRCONC4_bit        _BIT_ACCESS(SLRCONC,4)
// SLRCONC<SLRCONC5>
extern volatile __bit                   SLRCONC5            __at(0x1875);	// @ (0x30E * 8 + 5)
#define                                 SLRCONC5_bit        _BIT_ACCESS(SLRCONC,5)
// SLRCONC<SLRCONC6>
extern volatile __bit                   SLRCONC6            __at(0x1876);	// @ (0x30E * 8 + 6)
#define                                 SLRCONC6_bit        _BIT_ACCESS(SLRCONC,6)
// SLRCONC<SLRCONC7>
extern volatile __bit                   SLRCONC7            __at(0x1877);	// @ (0x30E * 8 + 7)
#define                                 SLRCONC7_bit        _BIT_ACCESS(SLRCONC,7)
// SSP1STAT<SMP>
